Aspiring-Freeman/ArmPromgramDownloadPyocd/Driver/pyOCD/pyocd/debug/svd/data/M480_v1.svd
       <register derivedFrom="PA_DOUT">
          <name>PF_DOUT</name>
          <displayName>PF_DOUT</displayName>
          <description>PF Data Output Value</description>
          <addressOffset>0x148</addressOffset>
       </register>
       <register derivedFrom="PA_DATMSK">
          <name>PF_DATMSK</name>
          <displayName>PF_DATMSK</displayName>
          <description>PF Data Output Write Mask</description>
          <addressOffset>0x14C</addressOffset>
       </register>
       <register derivedFrom="PA_PIN">
          <name>PF_PIN</name>
          <displayName>PF_PIN</displayName>
          <description>PF Pin Value</description>
          <addressOffset>0x150</addressOffset>
       </register>
       <register derivedFrom="PA_DBEN">
          <name>PF_DBEN</name>
          <displayName>PF_DBEN</displayName>
          <description>PF De-bounce Enable Control Register</description>
          <addressOffset>0x154</addressOffset>
       </register>
       <register derivedFrom="PA_INTTYPE">
          <name>PF_INTTYPE</name>
          <displayName>PF_INTTYPE</displayName>
          <description>PF Interrupt Trigger Type Control</description>
          <addressOffset>0x158</addressOffset>
       </register>
       <register derivedFrom="PA_INTEN">
          <name>PF_INTEN</name>
          <displayName>PF_INTEN</displayName>
          <description>PF Interrupt Enable Control Register</description>
          <addressOffset>0x15C</addressOffset>
       </register>
       <register derivedFrom="PA_INTSRC">
          <name>PF_INTSRC</name>
          <displayName>PF_INTSRC</displayName>
          <description>PF Interrupt Source Flag</description>
          <addressOffset>0x160</addressOffset>
       </register>
       <register derivedFrom="PA_SMTEN">
          <name>PF_SMTEN</name>
          <displayName>PF_SMTEN</displayName>
          <description>PF Input Schmitt Trigger Enable Register</description>
          <addressOffset>0x164</addressOffset>
       </register>
       <register derivedFrom="PA_SLEWCTL">
          <name>PF_SLEWCTL</name>
          <displayName>PF_SLEWCTL</displayName>
          <description>PF High Slew Rate Control Register</description>
          <addressOffset>0x168</addressOffset>
       </register>
       <register derivedFrom="PA_PUSEL">
          <name>PF_PUSEL</name>
          <displayName>PF_PUSEL</displayName>
          <description>PF Pull-up and Pull-down Selection Register</description>
          <addressOffset>0x170</addressOffset>
       </register>
       <register derivedFrom="PA_MODE">
          <name>PG_MODE</name>
          <displayName>PG_MODE</displayName>
          <description>PG I/O Mode Control</description>
          <addressOffset>0x180</addressOffset>
       </register>
       <register derivedFrom="PA_DINOFF">
          <name>PG_DINOFF</name>
          <displayName>PG_DINOFF</displayName>
          <description>PG Digital Input Path Disable Control</description>
          <addressOffset>0x184</addressOffset>
       </register>
       <register derivedFrom="PA_DOUT">
          <name>PG_DOUT</name>
          <displayName>PG_DOUT</displayName>
          <description>PG Data Output Value</description>
          <addressOffset>0x188</addressOffset>
       </register>
       <register derivedFrom="PA_DATMSK">
          <name>PG_DATMSK</name>
          <displayName>PG_DATMSK</displayName>
          <description>PG Data Output Write Mask</description>
          <addressOffset>0x18C</addressOffset>
       </register>
       <register derivedFrom="PA_PIN">
          <name>PG_PIN</name>
          <displayName>PG_PIN</displayName>
          <description>PG Pin Value</description>
          <addressOffset>0x190</addressOffset>
       </register>
       <register derivedFrom="PA_DBEN">
          <name>PG_DBEN</name>
          <displayName>PG_DBEN</displayName>
          <description>PG De-bounce Enable Control Register</description>
          <addressOffset>0x194</addressOffset>
       </register>
       <register derivedFrom="PA_INTTYPE">
          <name>PG_INTTYPE</name>
          <displayName>PG_INTTYPE</displayName>
          <description>PG Interrupt Trigger Type Control</description>
          <addressOffset>0x198</addressOffset>
       </register>
       <register derivedFrom="PA_INTEN">
          <name>PG_INTEN</name>
          <displayName>PG_INTEN</displayName>
          <description>PG Interrupt Enable Control Register</description>
          <addressOffset>0x19C</addressOffset>
       </register>
       <register derivedFrom="PA_INTSRC">
          <name>PG_INTSRC</name>
          <displayName>PG_INTSRC</displayName>
          <description>PG Interrupt Source Flag</description>
          <addressOffset>0x1A0</addressOffset>
       </register>
       <register derivedFrom="PA_SMTEN">
          <name>PG_SMTEN</name>
          <displayName>PG_SMTEN</displayName>
          <description>PG Input Schmitt Trigger Enable Register</description>
          <addressOffset>0x1A4</addressOffset>
       </register>
       <register derivedFrom="PA_SLEWCTL">
          <name>PG_SLEWCTL</name>
          <displayName>PG_SLEWCTL</displayName>
          <description>PG High Slew Rate Control Register</description>
          <addressOffset>0x1A8</addressOffset>
       </register>
       <register derivedFrom="PA_PUSEL">
          <name>PG_PUSEL</name>
          <displayName>PG_PUSEL</displayName>
          <description>PG Pull-up and Pull-down Selection Register</description>
          <addressOffset>0x1B0</addressOffset>
       </register>
       <register derivedFrom="PA_MODE">
          <name>PH_MODE</name>
          <displayName>PH_MODE</displayName>
          <description>PH I/O Mode Control</description>
          <addressOffset>0x1C0</addressOffset>
       </register>
       <register derivedFrom="PA_DINOFF">
          <name>PH_DINOFF</name>
          <displayName>PH_DINOFF</displayName>
          <description>PH Digital Input Path Disable Control</description>
          <addressOffset>0x1C4</addressOffset>
       </register>
