Aspiring-Freeman/ArmPromgramDownloadPyocd/Driver/pyOCD/pyocd/debug/svd/data/M480_v1.svd
       <register derivedFrom="PG0_PDIO">
          <name>PG1_PDIO</name>
          <displayName>PG1_PDIO</displayName>
          <description>GPIO PG.n Pin Data Input/Output Register</description>
          <addressOffset>0x984</addressOffset>
       </register>
       <register derivedFrom="PG0_PDIO">
          <name>PG2_PDIO</name>
          <displayName>PG2_PDIO</displayName>
          <description>GPIO PG.n Pin Data Input/Output Register</description>
          <addressOffset>0x988</addressOffset>
       </register>
       <register derivedFrom="PG0_PDIO">
          <name>PG3_PDIO</name>
          <displayName>PG3_PDIO</displayName>
          <description>GPIO PG.n Pin Data Input/Output Register</description>
          <addressOffset>0x98C</addressOffset>
       </register>
       <register derivedFrom="PG0_PDIO">
          <name>PG4_PDIO</name>
          <displayName>PG4_PDIO</displayName>
          <description>GPIO PG.n Pin Data Input/Output Register</description>
          <addressOffset>0x990</addressOffset>
       </register>
       <register derivedFrom="PG0_PDIO">
          <name>PG5_PDIO</name>
          <displayName>PG5_PDIO</displayName>
          <description>GPIO PG.n Pin Data Input/Output Register</description>
          <addressOffset>0x994</addressOffset>
       </register>
       <register derivedFrom="PG0_PDIO">
          <name>PG6_PDIO</name>
          <displayName>PG6_PDIO</displayName>
          <description>GPIO PG.n Pin Data Input/Output Register</description>
          <addressOffset>0x998</addressOffset>
       </register>
       <register derivedFrom="PG0_PDIO">
          <name>PG7_PDIO</name>
          <displayName>PG7_PDIO</displayName>
          <description>GPIO PG.n Pin Data Input/Output Register</description>
          <addressOffset>0x99C</addressOffset>
       </register>
       <register derivedFrom="PG0_PDIO">
          <name>PG8_PDIO</name>
          <displayName>PG8_PDIO</displayName>
          <description>GPIO PG.n Pin Data Input/Output Register</description>
          <addressOffset>0x9A0</addressOffset>
       </register>
       <register derivedFrom="PG0_PDIO">
          <name>PG9_PDIO</name>
          <displayName>PG9_PDIO</displayName>
          <description>GPIO PG.n Pin Data Input/Output Register</description>
          <addressOffset>0x9A4</addressOffset>
       </register>
       <register derivedFrom="PG0_PDIO">
          <name>PG10_PDIO</name>
          <displayName>PG10_PDIO</displayName>
          <description>GPIO PG.n Pin Data Input/Output Register</description>
          <addressOffset>0x9A8</addressOffset>
       </register>
       <register derivedFrom="PG0_PDIO">
          <name>PG11_PDIO</name>
          <displayName>PG11_PDIO</displayName>
          <description>GPIO PG.n Pin Data Input/Output Register</description>
          <addressOffset>0x9AC</addressOffset>
       </register>
       <register derivedFrom="PG0_PDIO">
          <name>PG12_PDIO</name>
          <displayName>PG12_PDIO</displayName>
          <description>GPIO PG.n Pin Data Input/Output Register</description>
          <addressOffset>0x9B0</addressOffset>
       </register>
       <register derivedFrom="PA0_PDIO">
          <name>PH0_PDIO</name>
          <displayName>PH0_PDIO</displayName>
          <description>GPIO PH.n Pin Data Input/Output Register</description>
          <addressOffset>0x9C0</addressOffset>
       </register>
       <register derivedFrom="PH0_PDIO">
          <name>PH1_PDIO</name>
          <displayName>PH1_PDIO</displayName>
          <description>GPIO PH.n Pin Data Input/Output Register</description>
          <addressOffset>0x9C4</addressOffset>
       </register>
       <register derivedFrom="PH0_PDIO">
          <name>PH2_PDIO</name>
          <displayName>PH2_PDIO</displayName>
          <description>GPIO PH.n Pin Data Input/Output Register</description>
          <addressOffset>0x9C8</addressOffset>
       </register>
       <register derivedFrom="PH0_PDIO">
          <name>PH3_PDIO</name>
          <displayName>PH3_PDIO</displayName>
          <description>GPIO PH.n Pin Data Input/Output Register</description>
          <addressOffset>0x9CC</addressOffset>
       </register>
       <register derivedFrom="PH0_PDIO">
          <name>PH4_PDIO</name>
          <displayName>PH4_PDIO</displayName>
          <description>GPIO PH.n Pin Data Input/Output Register</description>
          <addressOffset>0x9D0</addressOffset>
       </register>
       <register derivedFrom="PH0_PDIO">
          <name>PH5_PDIO</name>
          <displayName>PH5_PDIO</displayName>
          <description>GPIO PH.n Pin Data Input/Output Register</description>
          <addressOffset>0x9D4</addressOffset>
       </register>
       <register derivedFrom="PH0_PDIO">
          <name>PH6_PDIO</name>
          <displayName>PH6_PDIO</displayName>
          <description>GPIO PH.n Pin Data Input/Output Register</description>
          <addressOffset>0x9D8</addressOffset>
       </register>
       <register derivedFrom="PH0_PDIO">
          <name>PH7_PDIO</name>
          <displayName>PH7_PDIO</displayName>
          <description>GPIO PH.n Pin Data Input/Output Register</description>
          <addressOffset>0x9DC</addressOffset>
       </register>
       <register derivedFrom="PH0_PDIO">
          <name>PH8_PDIO</name>
          <displayName>PH8_PDIO</displayName>
          <description>GPIO PH.n Pin Data Input/Output Register</description>
          <addressOffset>0x9E0</addressOffset>
       </register>
       <register derivedFrom="PH0_PDIO">
          <name>PH9_PDIO</name>
          <displayName>PH9_PDIO</displayName>
          <description>GPIO PH.n Pin Data Input/Output Register</description>
          <addressOffset>0x9E4</addressOffset>
       </register>
       <register derivedFrom="PH0_PDIO">
          <name>PH10_PDIO</name>
          <displayName>PH10_PDIO</displayName>
          <description>GPIO PH.n Pin Data Input/Output Register</description>
          <addressOffset>0x9E8</addressOffset>
       </register>
       <register derivedFrom="PH0_PDIO">
          <name>PH11_PDIO</name>
          <displayName>PH11_PDIO</displayName>
          <description>GPIO PH.n Pin Data Input/Output Register</description>
          <addressOffset>0x9EC</addressOffset>
       </register>
       <register derivedFrom="PH0_PDIO">
          <name>PH12_PDIO</name>
          <displayName>PH12_PDIO</displayName>
          <description>GPIO PH.n Pin Data Input/Output Register</description>
          <addressOffset>0x9F0</addressOffset>
       </register>
