Aspiring-Freeman/ArmPromgramDownloadPyocd/Driver/pyOCD/pyocd/debug/svd/data/M480_v1.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DSCT_SA</name>
      <description>PDMA Register Map</description>
      <groupName>PDMA</groupName>
      <baseAddress>0x40008004</baseAddress>
      <!-- the first addressBlock is occupied by registers. The second block is reserved -> no access permission -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x20</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x30</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x40</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x50</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x60</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x70</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x80</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x90</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xA0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xB0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xD0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xE0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xF0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
       <register>
          <name>PDMA_DSCT0_SA</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PDMA_DSCT0_SA</displayName>
          <description>Source Address Register of PDMA Channel n</description>
          <addressOffset>0x0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>SA</name>
              <description>PDMA Transfer Source Address\nThis field indicates a 32-bit source address of PDMA controller.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="PDMA_DSCT0_SA">
          <name>PDMA_DSCT1_SA</name>
          <displayName>PDMA_DSCT1_SA</displayName>
          <description>Source Address Register of PDMA Channel n</description>
          <addressOffset>0x10</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_SA">
          <name>PDMA_DSCT2_SA</name>
          <displayName>PDMA_DSCT2_SA</displayName>
          <description>Source Address Register of PDMA Channel n</description>
          <addressOffset>0x20</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_SA">
          <name>PDMA_DSCT3_SA</name>
          <displayName>PDMA_DSCT3_SA</displayName>
          <description>Source Address Register of PDMA Channel n</description>
          <addressOffset>0x30</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_SA">
          <name>PDMA_DSCT4_SA</name>
          <displayName>PDMA_DSCT4_SA</displayName>
          <description>Source Address Register of PDMA Channel n</description>
          <addressOffset>0x40</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_SA">
          <name>PDMA_DSCT5_SA</name>
          <displayName>PDMA_DSCT5_SA</displayName>
          <description>Source Address Register of PDMA Channel n</description>
          <addressOffset>0x50</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_SA">
          <name>PDMA_DSCT6_SA</name>
          <displayName>PDMA_DSCT6_SA</displayName>
          <description>Source Address Register of PDMA Channel n</description>
          <addressOffset>0x60</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_SA">
          <name>PDMA_DSCT7_SA</name>
          <displayName>PDMA_DSCT7_SA</displayName>
          <description>Source Address Register of PDMA Channel n</description>
          <addressOffset>0x70</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_SA">
          <name>PDMA_DSCT8_SA</name>
          <displayName>PDMA_DSCT8_SA</displayName>
          <description>Source Address Register of PDMA Channel n</description>
          <addressOffset>0x80</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_SA">
          <name>PDMA_DSCT9_SA</name>
          <displayName>PDMA_DSCT9_SA</displayName>
          <description>Source Address Register of PDMA Channel n</description>
          <addressOffset>0x90</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_SA">
          <name>PDMA_DSCT10_SA</name>
          <displayName>PDMA_DSCT10_SA</displayName>
          <description>Source Address Register of PDMA Channel n</description>
          <addressOffset>0xA0</addressOffset>
       </register>
