Aspiring-Freeman/ArmPromgramDownloadPyocd/Driver/pyOCD/pyocd/debug/svd/data/M480_v1.svd
       <register>
          <name>PDMA_TOC0_1</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PDMA_TOC0_1</displayName>
          <description>PDMA Time-out Counter Ch1 and Ch0 Register</description>
          <addressOffset>0x440</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TOC0</name>
              <description>Time-out Counter for Channel 0\nThis controls the period of time-out function for channel 0. The calculation unit is based on TOUTPSC0 (PDMA_TOUTPSC[2:0]) clock.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOC1</name>
              <description>Time-out Counter for Channel 1\nThis controls the period of time-out function for channel 1. The calculation unit is based on 10 kHz clock. The example of time-out period can refer TOC0 bit description.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>PDMA_CHRST</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PDMA_CHRST</displayName>
          <description>PDMA Channel Reset Register</description>
          <addressOffset>0x460</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CHnRST</name>
              <description>Channel n Reset\nNote: This function don't support stride mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>corresponding channel n is not reset</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>corresponding channel n is reset</description>
                    <value>1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>PDMA_REQSEL0_3</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PDMA_REQSEL0_3</displayName>
          <description>PDMA Request Source Select Register 0</description>
          <addressOffset>0x480</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REQSRC0</name>
              <description>Channel 0 Request Source Selection\nThis filed defines which peripheral is connected to PDMA channel 0. User can configure the peripheral by setting REQSRC0.\nNote 1: A peripheral cannot be assigned to two channels at the same time.\nNote 2: This field is useless when transfer between memory and memory.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Disable PDMA peripheral request</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Reserved.</description>
                    <value>1</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>Channel connects to USB_TX</description>
                    <value>2</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>Channel connects to USB_RX</description>
                    <value>3</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>4</name>
                    <description>Channel connects to UART0_TX</description>
                    <value>4</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>5</name>
                    <description>Channel connects to UART0_RX</description>
                    <value>5</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>6</name>
                    <description>Channel connects to UART1_TX</description>
                    <value>6</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>7</name>
                    <description>Channel connects to UART1_RX</description>
                    <value>7</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>8</name>
                    <description>Channel connects to UART2_TX</description>
                    <value>8</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>9</name>
                    <description>Channel connects to UART2_RX</description>
                    <value>9</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>10</name>
                    <description>Channel connects to UART3_TX</description>
                    <value>10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>11</name>
                    <description>Channel connects to UART3_RX</description>
                    <value>11</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>12</name>
                    <description>Channel connects to UART4_TX</description>
                    <value>12</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>13</name>
                    <description>Channel connects to UART4_RX</description>
                    <value>13</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>14</name>
                    <description>Channel connects to UART5_TX</description>
                    <value>14</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>15</name>
                    <description>Channel connects to UART5_RX</description>
                    <value>15</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>16</name>
                    <description>Channel connects to USCI0_TX</description>
                    <value>16</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>17</name>
                    <description>Channel connects to USCI0_RX</description>
                    <value>17</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>18</name>
                    <description>Channel connects to USCI1_TX</description>
                    <value>18</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>19</name>
                    <description>Channel connects to USCI1_RX</description>
                    <value>19</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>20</name>
                    <description>Channel connects to QSPI0_TX</description>
                    <value>20</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>21</name>
                    <description>Channel connects to QSPI0_RX</description>
                    <value>21</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>22</name>
                    <description>Channel connects to SPI0_TX</description>
                    <value>22</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>23</name>
                    <description>Channel connects to SPI0_RX</description>
                    <value>23</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>24</name>
                    <description>Channel connects to SPI1_TX</description>
                    <value>24</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>25</name>
                    <description>Channel connects to SPI1_RX</description>
                    <value>25</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>26</name>
                    <description>Channel connects to SPI2_TX</description>
                    <value>26</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>27</name>
                    <description>Channel connects to SPI2_RX</description>
                    <value>27</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>28</name>
                    <description>Channel connects to SPI3_TX</description>
                    <value>28</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>29</name>
                    <description>Channel connects to SPI3_RX</description>
                    <value>29</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>30</name>
                    <description>Channel connects to QSPI1_TX</description>
                    <value>30</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>31</name>
                    <description>Channel connects to QSPI1_RX</description>
                    <value>31</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>32</name>
                    <description>Channel connects to EPWM0_P1_RX</description>
                    <value>32</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>33</name>
                    <description>Channel connects to EPWM0_P2_RX</description>
                    <value>33</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>34</name>
                    <description>Channel connects to EPWM0_P3_RX</description>
                    <value>34</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>35</name>
                    <description>Channel connects to EPWM1_P1_RX</description>
                    <value>35</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>36</name>
                    <description>Channel connects to EPWM1_P2_RX</description>
                    <value>36</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>37</name>
                    <description>Channel connects to EPWM1_P3_RX</description>
                    <value>37</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>38</name>
                    <description>Channel connects to I2C0_TX</description>
                    <value>38</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>39</name>
                    <description>Channel connects to I2C0_RX</description>
                    <value>39</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>40</name>
                    <description>Channel connects to I2C1_TX</description>
                    <value>40</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>41</name>
                    <description>Channel connects to I2C1_RX</description>
                    <value>41</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>42</name>
                    <description>Channel connects to I2C2_TX</description>
                    <value>42</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>43</name>
                    <description>Channel connects to I2C2_RX</description>
                    <value>43</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>44</name>
                    <description>Channel connects to I2S0_TX</description>
                    <value>44</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>45</name>
                    <description>Channel connects to I2S0_RX</description>
                    <value>45</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>46</name>
                    <description>Channel connects to TMR0</description>
                    <value>46</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>47</name>
                    <description>Channel connects to TMR1</description>
                    <value>47</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>48</name>
                    <description>Channel connects to TMR2</description>
                    <value>48</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>49</name>
                    <description>Channel connects to TMR3</description>
                    <value>49</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>50</name>
                    <description>Channel connects to EADC0_RX</description>
                    <value>50</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>51</name>
                    <description>Channel connects to DAC0_TX</description>
                    <value>51</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>52</name>
                    <description>Channel connects to DAC1_TX</description>
                    <value>52</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>53</name>
                    <description>Channel connects to EPWM0_CH0_TX</description>
                    <value>53</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>54</name>
                    <description>Channel connects to EPWM0_CH1_TX</description>
                    <value>54</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>55</name>
                    <description>Channel connects to EPWM0_CH2_TX</description>
                    <value>55</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>56</name>
                    <description>Channel connects to EPWM0_CH3_TX</description>
                    <value>56</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>57</name>
                    <description>Channel connects to EPWM0_CH4_TX</description>
                    <value>57</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>58</name>
                    <description>Channel connects to EPWM0_CH5_TX</description>
                    <value>58</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>59</name>
                    <description>Channel connects to EPWM1_CH0_TX</description>
                    <value>59</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>60</name>
                    <description>Channel connects to EPWM1_CH1_TX</description>
                    <value>60</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>61</name>
                    <description>Channel connects to EPWM1_CH2_TX</description>
                    <value>61</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>62</name>
                    <description>Channel connects to EPWM1_CH3_TX</description>
                    <value>62</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>63</name>
                    <description>Channel connects to EPWM1_CH4_TX</description>
                    <value>63</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>64</name>
                    <description>Channel connects to EPWM1_CH5_TX</description>
                    <value>64</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>65</name>
                    <description>Reserved.</description>
                    <value>65</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>66</name>
                    <description>Channel connects to UART6_TX</description>
                    <value>66</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>67</name>
                    <description>Channel connects to UART6_RX</description>
                    <value>67</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>68</name>
                    <description>Channel connects to UART7_TX</description>
                    <value>68</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>69</name>
                    <description>Channel connects to UART7_RX</description>
                    <value>69</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>70</name>
                    <description>Channel connects to EADC1_RX</description>
                    <value>70</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>REQSRC1</name>
              <description>Channel 1 Request Source Selection\nThis filed defines which peripheral is connected to PDMA channel 1. User can configure the peripheral setting by REQSRC1. \nNote: The channel configuration is the same as REQSRC0 field. Please refer to the explanation of REQSRC0.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REQSRC2</name>
              <description>Channel 2 Request Source Selection\nThis filed defines which peripheral is connected to PDMA channel 2. User can configure the peripheral setting by REQSRC2. \nNote: The channel configuration is the same as REQSRC0 field. Please refer to the explanation of REQSRC0.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REQSRC3</name>
              <description>Channel 3 Request Source Selection\nThis filed defines which peripheral is connected to PDMA channel 3. User can configure the peripheral setting by REQSRC3. \nNote: The channel configuration is the same as REQSRC0 field. Please refer to the explanation of REQSRC0.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>PDMA_REQSEL4_7</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PDMA_REQSEL4_7</displayName>
          <description>PDMA Request Source Select Register 1</description>
          <addressOffset>0x484</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REQSRC4</name>
              <description>Channel 4 Request Source Selection\nThis filed defines which peripheral is connected to PDMA channel 4. User can configure the peripheral setting by REQSRC4. \nNote: The channel configuration is the same as REQSRC0 field. Please refer to the explanation of REQSRC0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REQSRC5</name>
              <description>Channel 5 Request Source Selection\nThis filed defines which peripheral is connected to PDMA channel 5. User can configure the peripheral setting by REQSRC5. \nNote: The channel configuration is the same as REQSRC0 field. Please refer to the explanation of REQSRC0.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REQSRC6</name>
              <description>Channel 6 Request Source Selection\nThis filed defines which peripheral is connected to PDMA channel 6. User can configure the peripheral setting by REQSRC6. \nNote: The channel configuration is the same as REQSRC0 field. Please refer to the explanation of REQSRC0.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REQSRC7</name>
              <description>Channel 7 Request Source Selection\nThis filed defines which peripheral is connected to PDMA channel 7. User can configure the peripheral setting by REQSRC7. \nNote: The channel configuration is the same as REQSRC0 field. Please refer to the explanation of REQSRC0.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
