Aspiring-Freeman/ArmPromgramDownloadPyocd/Driver/pyOCD/pyocd/debug/svd/data/M480_v1.svd
       <register>
          <name>PDMA_REQSEL8_11</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PDMA_REQSEL8_11</displayName>
          <description>PDMA Request Source Select Register 2</description>
          <addressOffset>0x488</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REQSRC8</name>
              <description>Channel 8 Request Source Selection\nThis filed defines which peripheral is connected to PDMA channel 8. User can configure the peripheral setting by REQSRC8. \nNote: The channel configuration is the same as REQSRC0 field. Please refer to the explanation of REQSRC0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REQSRC9</name>
              <description>Channel 9 Request Source Selection\nThis filed defines which peripheral is connected to PDMA channel 9. User can configure the peripheral setting by REQSRC9. \nNote: The channel configuration is the same as REQSRC0 field. Please refer to the explanation of REQSRC0.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REQSRC10</name>
              <description>Channel 10 Request Source Selection\nThis filed defines which peripheral is connected to PDMA channel 10. User can configure the peripheral setting by REQSRC10. \nNote: The channel configuration is the same as REQSRC0 field. Please refer to the explanation of REQSRC0.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REQSRC11</name>
              <description>Channel 11 Request Source Selection\nThis filed defines which peripheral is connected to PDMA channel 11. User can configure the peripheral setting by REQSRC11. \nNote: The channel configuration is the same as REQSRC0 field. Please refer to the explanation of REQSRC0.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>PDMA_REQSEL12_15</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PDMA_REQSEL12_15</displayName>
          <description>PDMA Request Source Select Register 3</description>
          <addressOffset>0x48C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REQSRC12</name>
              <description>Channel 12 Request Source Selection\nThis filed defines which peripheral is connected to PDMA channel 12. User can configure the peripheral setting by REQSRC12. \nNote: The channel configuration is the same as REQSRC0 field. Please refer to the explanation of REQSRC0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REQSRC13</name>
              <description>Channel 13 Request Source Selection\nThis filed defines which peripheral is connected to PDMA channel 13. User can configure the peripheral setting by REQSRC13. \nNote: The channel configuration is the same as REQSRC0 field. Please refer to the explanation of REQSRC0.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REQSRC14</name>
              <description>Channel 14 Request Source Selection\nThis filed defines which peripheral is connected to PDMA channel 14. User can configure the peripheral setting by REQSRC14. \nNote: The channel configuration is the same as REQSRC0 field. Please refer to the explanation of REQSRC0.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REQSRC15</name>
              <description>Channel 15 Request Source Selection\nThis filed defines which peripheral is connected to PDMA channel 15. User can configure the peripheral setting by REQSRC15. \nNote: The channel configuration is the same as REQSRC0 field. Please refer to the explanation of REQSRC0.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>PDMA_STC0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PDMA_STC0</displayName>
          <description>Stride Transfer Count Register of PDMA Channel 0</description>
          <addressOffset>0x500</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STC</name>
              <description>PDMA Stride Transfer Count\nThe 16-bit register defines the stride transfer count of each row, the real transfer count is (STC + 1).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>PDMA_ASOCTL0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PDMA_ASOCTL0</displayName>
          <description>Address Stride Offset Control Register of PDMA Channel 0</description>
          <addressOffset>0x504</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SASOL</name>
              <description>PDMA Source Address Stride Offset Length\nThe 16-bit register defines the source address stride transfer offset count of each row.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DASOL</name>
              <description>PDMA Destination Address Stride Offset Length\nThe 16-bit register defines the destination address stride transfer offset count of each row.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="PDMA_STC0">
          <name>PDMA_STC1</name>
          <displayName>PDMA_STC1</displayName>
          <description>Stride Transfer Count Register of PDMA Channel 1</description>
          <addressOffset>0x508</addressOffset>
       </register>
       <register derivedFrom="PDMA_ASOCTL0">
          <name>PDMA_ASOCTL1</name>
          <displayName>PDMA_ASOCTL1</displayName>
          <description>Address Stride Offset Control Register of PDMA Channel 1</description>
          <addressOffset>0x50C</addressOffset>
       </register>
       <register derivedFrom="PDMA_STC0">
          <name>PDMA_STC2</name>
          <displayName>PDMA_STC2</displayName>
          <description>Stride Transfer Count Register of PDMA Channel 2</description>
          <addressOffset>0x510</addressOffset>
       </register>
       <register derivedFrom="PDMA_ASOCTL0">
          <name>PDMA_ASOCTL2</name>
          <displayName>PDMA_ASOCTL2</displayName>
          <description>Address Stride Offset Control Register of PDMA Channel 2</description>
          <addressOffset>0x514</addressOffset>
       </register>
       <register derivedFrom="PDMA_STC0">
          <name>PDMA_STC3</name>
          <displayName>PDMA_STC3</displayName>
          <description>Stride Transfer Count Register of PDMA Channel 3</description>
          <addressOffset>0x518</addressOffset>
       </register>
       <register derivedFrom="PDMA_ASOCTL0">
          <name>PDMA_ASOCTL3</name>
          <displayName>PDMA_ASOCTL3</displayName>
          <description>Address Stride Offset Control Register of PDMA Channel 3</description>
          <addressOffset>0x51C</addressOffset>
       </register>
       <register derivedFrom="PDMA_STC0">
          <name>PDMA_STC4</name>
          <displayName>PDMA_STC4</displayName>
          <description>Stride Transfer Count Register of PDMA Channel 4</description>
          <addressOffset>0x520</addressOffset>
       </register>
       <register derivedFrom="PDMA_ASOCTL0">
          <name>PDMA_ASOCTL4</name>
          <displayName>PDMA_ASOCTL4</displayName>
          <description>Address Stride Offset Control Register of PDMA Channel 4</description>
          <addressOffset>0x524</addressOffset>
       </register>
       <register derivedFrom="PDMA_STC0">
          <name>PDMA_STC5</name>
          <displayName>PDMA_STC5</displayName>
          <description>Stride Transfer Count Register of PDMA Channel 5</description>
          <addressOffset>0x528</addressOffset>
       </register>
       <register derivedFrom="PDMA_ASOCTL0">
          <name>PDMA_ASOCTL5</name>
          <displayName>PDMA_ASOCTL5</displayName>
          <description>Address Stride Offset Control Register of PDMA Channel 5</description>
          <addressOffset>0x52C</addressOffset>
       </register>
       <register>
          <name>PDMA_AICTL0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PDMA_AICTL0</displayName>
          <description>Address Interval Control Register of PDMA Channel 0</description>
          <addressOffset>0x600</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SAICNT</name>
              <description>PDMA Source Address Interval Count\nThe 16-bit register defines the source address interval count of each row.\nNote: This register should be set to 0 when repeat count(PDMA_RCNTn) set to 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAICNT</name>
              <description>PDMA Destination Address Interval Count\nThe 16-bit register defines the destination address interval count of each row.\nNote: This register should be set to 0 when repeat count(PDMA_RCNTn) set to 0.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>PDMA_RCNT0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PDMA_RCNT0</displayName>
          <description>Repeat Count Register of PDMA Channel 0</description>
          <addressOffset>0x604</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RCNT</name>
              <description>PDMA Repeat Count\nThe 16-bit register defines the repeat times of block transfer.\nNote: This register should be set to 0 when stride function disabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="PDMA_AICTL0">
          <name>PDMA_AICTL1</name>
          <displayName>PDMA_AICTL1</displayName>
          <description>Address Interval Control Register of PDMA Channel 1</description>
          <addressOffset>0x608</addressOffset>
       </register>
       <register derivedFrom="PDMA_RCNT0">
          <name>PDMA_RCNT1</name>
          <displayName>PDMA_RCNT1</displayName>
          <description>Repeat Count Register of PDMA Channel 1</description>
          <addressOffset>0x60C</addressOffset>
       </register>
