Aspiring-Freeman/ArmPromgramDownloadPyocd/Driver/pyOCD/pyocd/debug/svd/data/M480_v1.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>EMAC</name>
      <description>EMAC Register Map</description>
      <groupName>EMAC</groupName>
      <baseAddress>0x4000B000</baseAddress>
      <!-- the first addressBlock is occupied by registers. The second block is reserved -> no access permission -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0xC0</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC8</offset>
        <size>0x14</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x100</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x110</offset>
        <size>0x20</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
       <register>
          <name>EMAC_CAMCTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EMAC_CAMCTL</displayName>
          <description>CAM Comparison Control Register</description>
          <addressOffset>0x0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AUP</name>
              <description>Accept Unicast Packet\nThe AUP controls the unicast packet reception. If AUP is enabled, EMAC receives all incoming packet its destination MAC address is a unicast address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>EMAC receives packet depends on the CAM comparison result</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>EMAC receives all unicast packets</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>AMP</name>
              <description>Accept Multicast Packet\nThe AMP controls the multicast packet reception. If AMP is enabled, EMAC receives all incoming packet its destination MAC address is a multicast address.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>EMAC receives packet depends on the CAM comparison result</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>EMAC receives all multicast packets</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>ABP</name>
              <description>Accept Broadcast Packet\nThe ABP controls the broadcast packet reception. If ABP is enabled, EMAC receives all incoming packet its destination MAC address is a broadcast address.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>EMAC receives packet depends on the CAM comparison result</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>EMAC receives all broadcast packets</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPEN</name>
              <description>Complement CAM Comparison Enable Bit\nThe COMPEN controls the complement of the CAM comparison result. If the CMPEN and COMPEN are both enabled, the incoming packet with specific destination MAC address configured in CAM entry will be dropped. And the incoming packet with destination MAC address does not configured in any CAM entry will be received.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Complement CAM comparison result Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Complement CAM comparison result Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPEN</name>
              <description>CAM Compare Enable Bit\nThe CMPEN controls the enable of CAM comparison function for destination MAC address recognition. If software wants to receive a packet with specific destination MAC address, configures the MAC address into CAM 12~0, then enables that CAM entry and set CMPEN to 1.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>CAM comparison function for destination MAC address recognition Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>CAM comparison function for destination MAC address recognition Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>ECAM_CAMEN</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>ECAM_CAMEN</displayName>
          <description>CAM Enable Register</description>
          <addressOffset>0x4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CAMxEN</name>
              <description>CAM Entry X Enable Bit\nThe CAMxEN controls the validation of CAM entry x.\nThe CAM entry 13, 14 and 15 are for PAUSE control frame transmission. If software wants to transmit a PAUSE control frame out to network, the enable bits of these three CAM entries all must be enabled first.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>CAM entry x Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>CAM entry x Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>EMAC_CAM0M</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EMAC_CAM0M</displayName>
          <description>CAM0 Most Significant Word Register</description>
          <addressOffset>0x8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MACADDR2</name>
              <description>MAC Address Byte 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MACADDR3</name>
              <description>MAC Address Byte 3</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MACADDR4</name>
              <description>MAC Address Byte 4</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MACADDR5</name>
              <description>MAC Address Byte 5\nThe CAMxM keeps the bit 47~16 of MAC address. The x can be the 0~14. The register pair {EMAC_CAMxM, EMAC_CAMxL} represents a CAM entry and keeps a MAC address.\nFor example, if the MAC address 00-50-BA-33-BA-44 kept in CAM entry 1, the register EMAC_CAM1M is 0x0050_BA33 and EMAC_CAM1L is 0xBA44_0000.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>EMAC_CAM0L</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EMAC_CAM0L</displayName>
          <description>CAM0 Least Significant Word Register</description>
          <addressOffset>0xC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MACADDR0</name>
              <description>MAC Address Byte 0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MACADDR1</name>
              <description>MAC Address Byte 1\nThe CAMxL keeps the bit 15~0 of MAC address. The x can be the 0~14. The register pair {EMAC_CAMxM, EMAC_CAMxL} represents a CAM entry and keeps a MAC address.\nFor example, if the MAC address 00-50-BA-33-BA-44 kept in CAM entry 1, the register EMAC_CAM1M is 0x0050_BA33 and EMAC_CAM1L is 0xBA44_0000.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="EMAC_CAM0M">
          <name>EMAC_CAM1M</name>
          <displayName>EMAC_CAM1M</displayName>
          <description>CAM1 Most Significant Word Register</description>
          <addressOffset>0x10</addressOffset>
       </register>
       <register derivedFrom="EMAC_CAM0L">
          <name>EMAC_CAM1L</name>
          <displayName>EMAC_CAM1L</displayName>
          <description>CAM1 Least Significant Word Register</description>
          <addressOffset>0x14</addressOffset>
       </register>
       <register derivedFrom="EMAC_CAM0M">
          <name>EMAC_CAM2M</name>
          <displayName>EMAC_CAM2M</displayName>
          <description>CAM2 Most Significant Word Register</description>
          <addressOffset>0x18</addressOffset>
       </register>
       <register derivedFrom="EMAC_CAM0L">
          <name>EMAC_CAM2L</name>
          <displayName>EMAC_CAM2L</displayName>
          <description>CAM2 Least Significant Word Register</description>
          <addressOffset>0x1C</addressOffset>
       </register>
       <register derivedFrom="EMAC_CAM0M">
          <name>EMAC_CAM3M</name>
          <displayName>EMAC_CAM3M</displayName>
          <description>CAM3 Most Significant Word Register</description>
          <addressOffset>0x20</addressOffset>
       </register>
       <register derivedFrom="EMAC_CAM0L">
          <name>EMAC_CAM3L</name>
          <displayName>EMAC_CAM3L</displayName>
          <description>CAM3 Least Significant Word Register</description>
          <addressOffset>0x24</addressOffset>
       </register>
       <register derivedFrom="EMAC_CAM0M">
          <name>EMAC_CAM4M</name>
          <displayName>EMAC_CAM4M</displayName>
          <description>CAM4 Most Significant Word Register</description>
          <addressOffset>0x28</addressOffset>
       </register>
       <register derivedFrom="EMAC_CAM0L">
          <name>EMAC_CAM4L</name>
          <displayName>EMAC_CAM4L</displayName>
          <description>CAM4 Least Significant Word Register</description>
          <addressOffset>0x2C</addressOffset>
       </register>
       <register derivedFrom="EMAC_CAM0M">
          <name>EMAC_CAM5M</name>
          <displayName>EMAC_CAM5M</displayName>
          <description>CAM5 Most Significant Word Register</description>
          <addressOffset>0x30</addressOffset>
       </register>
       <register derivedFrom="EMAC_CAM0L">
          <name>EMAC_CAM5L</name>
          <displayName>EMAC_CAM5L</displayName>
          <description>CAM5 Least Significant Word Register</description>
          <addressOffset>0x34</addressOffset>
       </register>
       <register derivedFrom="EMAC_CAM0M">
          <name>EMAC_CAM6M</name>
          <displayName>EMAC_CAM6M</displayName>
          <description>CAM6 Most Significant Word Register</description>
          <addressOffset>0x38</addressOffset>
       </register>
       <register derivedFrom="EMAC_CAM0L">
          <name>EMAC_CAM6L</name>
          <displayName>EMAC_CAM6L</displayName>
          <description>CAM6 Least Significant Word Register</description>
          <addressOffset>0x3C</addressOffset>
       </register>
       <register derivedFrom="EMAC_CAM0M">
          <name>EMAC_CAM7M</name>
          <displayName>EMAC_CAM7M</displayName>
          <description>CAM7 Most Significant Word Register</description>
          <addressOffset>0x40</addressOffset>
       </register>
       <register derivedFrom="EMAC_CAM0L">
          <name>EMAC_CAM7L</name>
          <displayName>EMAC_CAM7L</displayName>
          <description>CAM7 Least Significant Word Register</description>
          <addressOffset>0x44</addressOffset>
       </register>
       <register derivedFrom="EMAC_CAM0M">
          <name>EMAC_CAM8M</name>
          <displayName>EMAC_CAM8M</displayName>
          <description>CAM8 Most Significant Word Register</description>
          <addressOffset>0x48</addressOffset>
       </register>
       <register derivedFrom="EMAC_CAM0L">
          <name>EMAC_CAM8L</name>
          <displayName>EMAC_CAM8L</displayName>
          <description>CAM8 Least Significant Word Register</description>
          <addressOffset>0x4C</addressOffset>
       </register>
       <register derivedFrom="EMAC_CAM0M">
          <name>EMAC_CAM9M</name>
          <displayName>EMAC_CAM9M</displayName>
          <description>CAM9 Most Significant Word Register</description>
          <addressOffset>0x50</addressOffset>
       </register>
       <register derivedFrom="EMAC_CAM0L">
          <name>EMAC_CAM9L</name>
          <displayName>EMAC_CAM9L</displayName>
          <description>CAM9 Least Significant Word Register</description>
          <addressOffset>0x54</addressOffset>
       </register>
       <register derivedFrom="EMAC_CAM0M">
          <name>EMAC_CAM10M</name>
          <displayName>EMAC_CAM10M</displayName>
          <description>CAM10 Most Significant Word Register</description>
          <addressOffset>0x58</addressOffset>
       </register>
       <register derivedFrom="EMAC_CAM0L">
          <name>EMAC_CAM10L</name>
          <displayName>EMAC_CAM10L</displayName>
          <description>CAM10 Least Significant Word Register</description>
          <addressOffset>0x5C</addressOffset>
       </register>
       <register derivedFrom="EMAC_CAM0M">
          <name>EMAC_CAM11M</name>
          <displayName>EMAC_CAM11M</displayName>
          <description>CAM11 Most Significant Word Register</description>
          <addressOffset>0x60</addressOffset>
       </register>
       <register derivedFrom="EMAC_CAM0L">
          <name>EMAC_CAM11L</name>
          <displayName>EMAC_CAM11L</displayName>
          <description>CAM11 Least Significant Word Register</description>
          <addressOffset>0x64</addressOffset>
       </register>
       <register derivedFrom="EMAC_CAM0M">
          <name>EMAC_CAM12M</name>
          <displayName>EMAC_CAM12M</displayName>
          <description>CAM12 Most Significant Word Register</description>
          <addressOffset>0x68</addressOffset>
       </register>
       <register derivedFrom="EMAC_CAM0L">
          <name>EMAC_CAM12L</name>
          <displayName>EMAC_CAM12L</displayName>
          <description>CAM12 Least Significant Word Register</description>
          <addressOffset>0x6C</addressOffset>
       </register>
       <register derivedFrom="EMAC_CAM0M">
          <name>EMAC_CAM13M</name>
          <displayName>EMAC_CAM13M</displayName>
          <description>CAM13 Most Significant Word Register</description>
          <addressOffset>0x70</addressOffset>
       </register>
       <register derivedFrom="EMAC_CAM0L">
          <name>EMAC_CAM13L</name>
          <displayName>EMAC_CAM13L</displayName>
          <description>CAM13 Least Significant Word Register</description>
          <addressOffset>0x74</addressOffset>
       </register>
       <register derivedFrom="EMAC_CAM0M">
          <name>EMAC_CAM14M</name>
          <displayName>EMAC_CAM14M</displayName>
          <description>CAM14 Most Significant Word Register</description>
          <addressOffset>0x78</addressOffset>
       </register>
       <register derivedFrom="EMAC_CAM0L">
          <name>EMAC_CAM14L</name>
          <displayName>EMAC_CAM14L</displayName>
          <description>CAM14 Least Significant Word Register</description>
          <addressOffset>0x7C</addressOffset>
       </register>
       <register>
          <name>EMAC_CAM15MSB</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EMAC_CAM15MSB</displayName>
          <description>CAM15 Most Significant Word Register</description>
          <addressOffset>0x80</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OPCODE</name>
              <description>OP Code Field of PAUSE Control Frame\nIn the PAUSE control frame, an op code field defined and is 0x0001.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LENGTH</name>
              <description>LENGTH Field of PAUSE Control Frame\nIn the PAUSE control frame, a LENGTH field defined and is 0x8808.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>EMAC_CAM15LSB</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EMAC_CAM15LSB</displayName>
          <description>CAM15 Least Significant Word Register</description>
          <addressOffset>0x84</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OPERAND</name>
              <description>Pause Parameter\nIn the PAUSE control frame, an OPERAND field defined and controls how much time the destination Ethernet MAC Controller paused. The unit of the OPERAND is a slot time, the 512-bit time.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>EMAC_TXDSA</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EMAC_TXDSA</displayName>
          <description>Transmit Descriptor Link List Start Address Register</description>
          <addressOffset>0x88</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFFC</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXDSA</name>
              <description>Transmit Descriptor Link-list Start Address\nThe TXDSA keeps the start address of transmit descriptor link-list. If the software enables the bit TXON (EMAC_CTL[8]), the content of TXDSA will be loaded into the current transmit descriptor start address register (EMAC_CTXDSA). The TXDSA does not be updated by EMAC. During the operation, EMAC will ignore the bits [1:0] of TXDSA. This means that TX descriptors must locate at word boundary memory address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>EMAC_RXDSA</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EMAC_RXDSA</displayName>
          <description>Receive Descriptor Link List Start Address Register</description>
          <addressOffset>0x8C</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFFC</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXDSA</name>
              <description>Receive Descriptor Link-list Start Address\nThe RXDSA keeps the start address of receive descriptor link-list. If the S/W enables the bit RXON (EMAC_CTL[0]), the content of RXDSA will be loaded into the current receive descriptor start address register (EMAC_CRXDSA). The RXDSA does not be updated by EMAC. During the operation, EMAC will ignore the bits [1:0] of RXDSA. This means that RX descriptors must locate at word boundary memory address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
