Aspiring-Freeman/ArmPromgramDownloadPyocd/Driver/pyOCD/pyocd/debug/svd/data/M480_v1.svd
       <register>
          <name>CCAP_CWSP</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CCAP_CWSP</displayName>
          <description>Cropping Window Starting Address Register</description>
          <addressOffset>0x20</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CWSADDRH</name>
              <description>Cropping Window Horizontal Starting Address\nSpecify the value of the cropping window horizontal start address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CWSADDRV</name>
              <description>Cropping Window Vertical Starting Address\nSpecify the value of the cropping window vertical start address.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CCAP_CWS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CCAP_CWS</displayName>
          <description>Cropping Window Size Register</description>
          <addressOffset>0x24</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CWW</name>
              <description>Cropping Window Width\nSpecify the size of the cropping window width.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CWH</name>
              <description>Cropping Window Height\nSpecify the size of the cropping window height.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CCAP_PKTSL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CCAP_PKTSL</displayName>
          <description>Packet Scaling Vertical/Horizontal Factor Register (LSB)</description>
          <addressOffset>0x28</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKTSHML</name>
              <description>Packet Scaling Horizontal Factor m (Lower 8-bit)\nSpecify the lower 8-bit of denominator part (M) of the horizontal scaling factor.\nThe lower 8-bit will be cascaded with higher 8-bit (PKDSHMH) to form a 16-bit denominator (M) of vertical factor.\nThe output image width will be equal to the image width * N/M.\nNote: The value of N must be equal to or less than M.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PKTSHNL</name>
              <description>Packet Scaling Horizontal Factor n (Lower 8-bit)\nSpecify the lower 8-bit of numerator part (N) of the horizontal scaling factor.\nThe lower 8-bit will be cascaded with higher 8-bit (PKDSHNH) to form a 16-bit numerator of horizontal factor.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PKTSVML</name>
              <description>Packet Scaling Vertical Factor m (Lower 8-bit)\nSpecify the lower 8-bit of denominator part (M) of the vertical scaling factor.\nThe lower 8-bit will be cascaded with higher 8-bit (PKDSVMH) to form a 16-bit denominator (M) of vertical factor.\nThe output image width will be equal to the image height * N/M.\nNote: The value of N must be equal to or less than M.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PKTSVNL</name>
              <description>Packet Scaling Vertical Factor n (Lower 8-bit)\nSpecify the lower 8-bit of numerator part (N) of the vertical scaling factor. \nThe lower 8-bit will be cascaded with higher 8-bit (PKDSVNH) to form a 16-bit numerator of vertical factor.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CCAP_FRCTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CCAP_FRCTL</displayName>
          <description>Scaling Frame Rate Factor Register</description>
          <addressOffset>0x30</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FRM</name>
              <description>Scaling Frame Rate Factor M\nSpecify the denominator part (M) of the frame rate scaling factor.\nThe output image frame rate will be equal to input image frame rate * (N/M).\nNote: The value of N must be equal to or less than M.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRN</name>
              <description>Scaling Frame Rate Factor n\nSpecify the denominator part (N) of the frame rate scaling factor.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CCAP_STRIDE</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CCAP_STRIDE</displayName>
          <description>Frame Output Pixel Stride Width Register</description>
          <addressOffset>0x34</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKTSTRIDE</name>
              <description>Packet Frame Output Pixel Stride Width\nThe output pixel stride size of the packet pipe.\nIt is a 32-pixel aligned stride width for the Luma-Y-One bit format or a 4-pixel aligned stride with for the Luma-Y-Eight bit format when color or monochrome CMOS sensors used. This means that every new captured line is by word alignment address when color or monochrome CMOS sensors used.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CCAP_FIFOTH</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CCAP_FIFOTH</displayName>
          <description>FIFO Threshold Register</description>
          <addressOffset>0x3C</addressOffset>
          <access>read-write</access>
          <resetValue>0x070D0507</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKTFTH</name>
              <description>Packet FIFO Threshold\nSpecify the 5-bit value of the packet FIFO threshold.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OVF</name>
              <description>FIFO Overflow Flag\nIndicate the FIFO overflow flag.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CCAP_CMPADDR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CCAP_CMPADDR</displayName>
          <description>Compare Memory Base Address Register</description>
          <addressOffset>0x40</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFFC</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CMPADDR</name>
              <description>Compare Memory Base Address\nIt is a word alignment address, that is, the address is aligned by ignoring the 2 LSB bits [1:0].</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CCAP_LUMA_Y1_THD</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CCAP_LUMA_Y1_THD</displayName>
          <description>Luminance Y8 to Y1 Threshold Value Register</description>
          <addressOffset>0x44</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000080</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LUMA_Y1_THRESH</name>
              <description>Luminance Y8 to Y1 Threshold Value\nSpecify the 8-bit threshold value for the luminance Y bit-8 to the luminance Y 1-bit conversion.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CCAP_PKTSM</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CCAP_PKTSM</displayName>
          <description>Packet Scaling Vertical/Horizontal Factor Register (MSB)</description>
          <addressOffset>0x48</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKTSHMH</name>
              <description>Packet Scaling Horizontal Factor m (Higher 8-bit)\nSpecify the lower 8-bit of denominator part (M) of the horizontal scaling factor.\nPlease refer to the register 'CCAP_PKTSL' for the detailed operation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PKTSHNH</name>
              <description>Packet Scaling Horizontal Factor n (Higher 8-bit)\nSpecify the lower 8-bit of numerator part (N) of the horizontal scaling factor.\nPlease refer to the register 'CCAP_PKTSL' for the detailed operation.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PKTSVMH</name>
              <description>Packet Scaling Vertical Factor m (Higher 8-bit)\nSpecify the lower 8-bit of denominator part (M) of the vertical scaling factor.\nPlease refer to the register 'CCAP_PKTSL' to check the cooperation between these two registers.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PKTSVNH</name>
              <description>Packet Scaling Vertical Factor n (Higher 8-bit)\nSpecify the higher 8-bit of numerator part (N) of the vertical scaling factor. \nPlease refer to the register 'CCAP_PKTSL' to check the cooperation between these two registers.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CCAP_CURADDRP</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CCAP_CURADDRP</displayName>
          <description>Current Packet System Memory Address Register</description>
          <addressOffset>0x50</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CURADDR</name>
              <description>Current Packet Output Memory Address\nSpeficy the 32-bit value of the current packet output memory address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CCAP_PKTBA0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CCAP_PKTBA0</displayName>
          <description>System Memory Packet Base Address 0 Register</description>
          <addressOffset>0x60</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BASEADDR</name>
              <description>System Memory Packet Base Address 0\nIt is a word alignment address, that is, the address is aligned by ignoring the 2 LSB bits [1:0].</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
