Aspiring-Freeman/ArmPromgramDownloadPyocd/Driver/pyOCD/pyocd/debug/svd/data/M480_v1.svd
       <register derivedFrom="HSUSBD_EPABUFEND">
          <name>HSUSBD_EPFBUFEND</name>
          <displayName>HSUSBD_EPFBUFEND</displayName>
          <description>Endpoint F RAM End Address Register</description>
          <addressOffset>0x150</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPADAT">
          <name>HSUSBD_EPGDAT</name>
          <displayName>HSUSBD_EPGDAT</displayName>
          <description>Endpoint G Data Register</description>
          <addressOffset>0x154</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPAINTSTS">
          <name>HSUSBD_EPGINTSTS</name>
          <displayName>HSUSBD_EPGINTSTS</displayName>
          <description>Endpoint G Interrupt Status Register</description>
          <addressOffset>0x158</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPAINTEN">
          <name>HSUSBD_EPGINTEN</name>
          <displayName>HSUSBD_EPGINTEN</displayName>
          <description>Endpoint G Interrupt Enable Register</description>
          <addressOffset>0x15C</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPADATCNT">
          <name>HSUSBD_EPGDATCNT</name>
          <displayName>HSUSBD_EPGDATCNT</displayName>
          <description>Endpoint G Data Available Count Register</description>
          <addressOffset>0x160</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPARSPCTL">
          <name>HSUSBD_EPGRSPCTL</name>
          <displayName>HSUSBD_EPGRSPCTL</displayName>
          <description>Endpoint G Response Control Register</description>
          <addressOffset>0x164</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPAMPS">
          <name>HSUSBD_EPGMPS</name>
          <displayName>HSUSBD_EPGMPS</displayName>
          <description>Endpoint G Maximum Packet Size Register</description>
          <addressOffset>0x168</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPATXCNT">
          <name>HSUSBD_EPGTXCNT</name>
          <displayName>HSUSBD_EPGTXCNT</displayName>
          <description>Endpoint G Transfer Count Register</description>
          <addressOffset>0x16C</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPACFG">
          <name>HSUSBD_EPGCFG</name>
          <displayName>HSUSBD_EPGCFG</displayName>
          <description>Endpoint G Configuration Register</description>
          <addressOffset>0x170</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPABUFSTART">
          <name>HSUSBD_EPGBUFSTART</name>
          <displayName>HSUSBD_EPGBUFSTART</displayName>
          <description>Endpoint G RAM Start Address Register</description>
          <addressOffset>0x174</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPABUFEND">
          <name>HSUSBD_EPGBUFEND</name>
          <displayName>HSUSBD_EPGBUFEND</displayName>
          <description>Endpoint G RAM End Address Register</description>
          <addressOffset>0x178</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPADAT">
          <name>HSUSBD_EPHDAT</name>
          <displayName>HSUSBD_EPHDAT</displayName>
          <description>Endpoint H Data Register</description>
          <addressOffset>0x17C</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPAINTSTS">
          <name>HSUSBD_EPHINTSTS</name>
          <displayName>HSUSBD_EPHINTSTS</displayName>
          <description>Endpoint H Interrupt Status Register</description>
          <addressOffset>0x180</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPAINTEN">
          <name>HSUSBD_EPHINTEN</name>
          <displayName>HSUSBD_EPHINTEN</displayName>
          <description>Endpoint H Interrupt Enable Register</description>
          <addressOffset>0x184</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPADATCNT">
          <name>HSUSBD_EPHDATCNT</name>
          <displayName>HSUSBD_EPHDATCNT</displayName>
          <description>Endpoint H Data Available Count Register</description>
          <addressOffset>0x188</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPARSPCTL">
          <name>HSUSBD_EPHRSPCTL</name>
          <displayName>HSUSBD_EPHRSPCTL</displayName>
          <description>Endpoint H Response Control Register</description>
          <addressOffset>0x18C</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPAMPS">
          <name>HSUSBD_EPHMPS</name>
          <displayName>HSUSBD_EPHMPS</displayName>
          <description>Endpoint H Maximum Packet Size Register</description>
          <addressOffset>0x190</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPATXCNT">
          <name>HSUSBD_EPHTXCNT</name>
          <displayName>HSUSBD_EPHTXCNT</displayName>
          <description>Endpoint H Transfer Count Register</description>
          <addressOffset>0x194</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPACFG">
          <name>HSUSBD_EPHCFG</name>
          <displayName>HSUSBD_EPHCFG</displayName>
          <description>Endpoint H Configuration Register</description>
          <addressOffset>0x198</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPABUFSTART">
          <name>HSUSBD_EPHBUFSTART</name>
          <displayName>HSUSBD_EPHBUFSTART</displayName>
          <description>Endpoint H RAM Start Address Register</description>
          <addressOffset>0x19C</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPABUFEND">
          <name>HSUSBD_EPHBUFEND</name>
          <displayName>HSUSBD_EPHBUFEND</displayName>
          <description>Endpoint H RAM End Address Register</description>
          <addressOffset>0x1A0</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPADAT">
          <name>HSUSBD_EPIDAT</name>
          <displayName>HSUSBD_EPIDAT</displayName>
          <description>Endpoint I Data Register</description>
          <addressOffset>0x1A4</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPAINTSTS">
          <name>HSUSBD_EPIINTSTS</name>
          <displayName>HSUSBD_EPIINTSTS</displayName>
          <description>Endpoint I Interrupt Status Register</description>
          <addressOffset>0x1A8</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPAINTEN">
          <name>HSUSBD_EPIINTEN</name>
          <displayName>HSUSBD_EPIINTEN</displayName>
          <description>Endpoint I Interrupt Enable Register</description>
          <addressOffset>0x1AC</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPADATCNT">
          <name>HSUSBD_EPIDATCNT</name>
          <displayName>HSUSBD_EPIDATCNT</displayName>
          <description>Endpoint I Data Available Count Register</description>
          <addressOffset>0x1B0</addressOffset>
       </register>
