Aspiring-Freeman/ArmPromgramDownloadPyocd/Driver/pyOCD/pyocd/debug/svd/data/M480_v1.svd
       <register derivedFrom="HSUSBD_EPACFG">
          <name>HSUSBD_EPKCFG</name>
          <displayName>HSUSBD_EPKCFG</displayName>
          <description>Endpoint K Configuration Register</description>
          <addressOffset>0x210</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPABUFSTART">
          <name>HSUSBD_EPKBUFSTART</name>
          <displayName>HSUSBD_EPKBUFSTART</displayName>
          <description>Endpoint K RAM Start Address Register</description>
          <addressOffset>0x214</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPABUFEND">
          <name>HSUSBD_EPKBUFEND</name>
          <displayName>HSUSBD_EPKBUFEND</displayName>
          <description>Endpoint K RAM End Address Register</description>
          <addressOffset>0x218</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPADAT">
          <name>HSUSBD_EPLDAT</name>
          <displayName>HSUSBD_EPLDAT</displayName>
          <description>Endpoint L Data Register</description>
          <addressOffset>0x21C</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPAINTSTS">
          <name>HSUSBD_EPLINTSTS</name>
          <displayName>HSUSBD_EPLINTSTS</displayName>
          <description>Endpoint L Interrupt Status Register</description>
          <addressOffset>0x220</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPAINTEN">
          <name>HSUSBD_EPLINTEN</name>
          <displayName>HSUSBD_EPLINTEN</displayName>
          <description>Endpoint L Interrupt Enable Register</description>
          <addressOffset>0x224</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPADATCNT">
          <name>HSUSBD_EPLDATCNT</name>
          <displayName>HSUSBD_EPLDATCNT</displayName>
          <description>Endpoint L Data Available Count Register</description>
          <addressOffset>0x228</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPARSPCTL">
          <name>HSUSBD_EPLRSPCTL</name>
          <displayName>HSUSBD_EPLRSPCTL</displayName>
          <description>Endpoint L Response Control Register</description>
          <addressOffset>0x22C</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPAMPS">
          <name>HSUSBD_EPLMPS</name>
          <displayName>HSUSBD_EPLMPS</displayName>
          <description>Endpoint L Maximum Packet Size Register</description>
          <addressOffset>0x230</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPATXCNT">
          <name>HSUSBD_EPLTXCNT</name>
          <displayName>HSUSBD_EPLTXCNT</displayName>
          <description>Endpoint L Transfer Count Register</description>
          <addressOffset>0x234</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPACFG">
          <name>HSUSBD_EPLCFG</name>
          <displayName>HSUSBD_EPLCFG</displayName>
          <description>Endpoint L Configuration Register</description>
          <addressOffset>0x238</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPABUFSTART">
          <name>HSUSBD_EPLBUFSTART</name>
          <displayName>HSUSBD_EPLBUFSTART</displayName>
          <description>Endpoint L RAM Start Address Register</description>
          <addressOffset>0x23C</addressOffset>
       </register>
       <register derivedFrom="HSUSBD_EPABUFEND">
          <name>HSUSBD_EPLBUFEND</name>
          <displayName>HSUSBD_EPLBUFEND</displayName>
          <description>Endpoint L RAM End Address Register</description>
          <addressOffset>0x240</addressOffset>
       </register>
       <register>
          <name>HSUSBD_DMAADDR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>HSUSBD_DMAADDR</displayName>
          <description>AHB DMA Address Register</description>
          <addressOffset>0x700</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMAADDR</name>
              <description>DMAADDR\nThe register specifies the address from which the DMA has to read / write. The address must WORD (32-bit) aligned.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>HSUSBD_PHYCTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>HSUSBD_PHYCTL</displayName>
          <description>USB PHY Control Register</description>
          <addressOffset>0x704</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000420</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DPPUEN</name>
              <description>DP Pull-up</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Pull-up resistor on D+ Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Pull-up resistor on D+ Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PHYEN</name>
              <description>PHY Suspend Enable Bit</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The USB PHY is suspend</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The USB PHY is not suspend</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>WKEN</name>
              <description>Wake-up Enable Bit</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The wake-up function Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The wake-up function Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>VBUSDET</name>
              <description>VBUS Status</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>The VBUS is not detected yet</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The VBUS is detected</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
