Aspiring-Freeman/ArmPromgramDownloadPyocd/Driver/pyOCD/pyocd/debug/svd/data/M480_v1.svd
       <register derivedFrom="CRYPTO_TDES0_CNT">
          <name>CRYPTO_TDES3_CNT</name>
          <displayName>CRYPTO_TDES3_CNT</displayName>
          <description>TDES/DES Byte Count Register for Channel 3</description>
          <addressOffset>0x2F0</addressOffset>
       </register>
       <register>
          <name>CRYPTO_HMAC_CTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_HMAC_CTL</displayName>
          <description>SHA/HMAC Control Register</description>
          <addressOffset>0x300</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>START</name>
              <description>SHA/HMAC Engine Start\nNote: This bit is always 0 when it's read back.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No effect</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Start SHA/HMAC engine. BUSY flag will be set</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>STOP</name>
              <description>SHA/HMAC Engine Stop\nNote: This bit is always 0 when it's read back.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No effect</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Stop SHA/HMAC engine</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>HMACEN</name>
              <description>HMAC_SHA Engine Operating Mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Execute SHA function</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Execute HMAC function</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DMALAST</name>
              <description>SHA/HMAC Last Block\nThis bit must be set as feeding in last byte of data.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMAEN</name>
              <description>SHA/HMAC Engine DMA Enable Bit\nSHA/HMAC engine operates in DMA mode, and data movement from/to the engine is done by DMA logic.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>SHA/HMAC DMA engine Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>SHA/HMAC DMA engine Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>OPMODE</name>
              <description>SHA/HMAC Engine Operation Modes\n0x0xx: SHA160\n0x100: SHA256\n0x101: SHA224\n0x110: SHA512\n0x111: SHA384</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTSWAP</name>
              <description>SHA/HMAC Engine Output Data Swap</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Keep the original order</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The order that CPU feeds data to the accelerator will be changed from {byte3, byte2, byte1, byte0} to {byte0, byte1, byte2, byte3}</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>INSWAP</name>
              <description>SHA/HMAC Engine Input Data Swap</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Keep the original order</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>The order that CPU feeds data to the accelerator will be changed from {byte3, byte2, byte1, byte0} to {byte0, byte1, byte2, byte3}</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_HMAC_STS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_HMAC_STS</displayName>
          <description>SHA/HMAC Status Flag</description>
          <addressOffset>0x304</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BUSY</name>
              <description>SHA/HMAC Engine Busy </description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>SHA/HMAC engine is idle or finished</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>SHA/HMAC engine is busy</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>DMABUSY</name>
              <description>SHA/HMAC Engine DMA Busy Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>SHA/HMAC DMA engine is idle or finished</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>SHA/HMAC DMA engine is busy</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>DMAERR</name>
              <description>SHA/HMAC Engine DMA Error Flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Show the SHA/HMAC engine access normal</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Show the SHA/HMAC engine access error</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>DATINREQ</name>
              <description>SHA/HMAC Non-dMA Mode Data Input Request</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No effect</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Request SHA/HMAC Non-DMA mode data input</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_HMAC_DGST0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_HMAC_DGST0</displayName>
          <description>SHA/HMAC Digest Message 0</description>
          <addressOffset>0x308</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DGST</name>
              <description>SHA/HMAC Digest Message Output Register\nFor SHA-160, the digest is stored in CRYPTO_HMAC_DGST0 ~ CRYPTO_HMAC_DGST4.\nFor SHA-224, the digest is stored in CRYPTO_HMAC_DGST0 ~ CRYPTO_HMAC_DGST6.\nFor SHA-256, the digest is stored in CRYPTO_HMAC_DGST0 ~ CRYPTO_HMAC_DGST7.\nFor SHA-384, the digest is stored in CRYPTO_HMAC_DGST0 ~ CRYPTO_HMAC_DGST11.\nFor SHA-512, the digest is stored in CRYPTO_HMAC_DGST0 ~ CRYPTO_HMAC_DGST15.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="CRYPTO_HMAC_DGST0">
          <name>CRYPTO_HMAC_DGST1</name>
          <displayName>CRYPTO_HMAC_DGST1</displayName>
          <description>SHA/HMAC Digest Message 1</description>
          <addressOffset>0x30C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_DGST0">
          <name>CRYPTO_HMAC_DGST2</name>
          <displayName>CRYPTO_HMAC_DGST2</displayName>
          <description>SHA/HMAC Digest Message 2</description>
          <addressOffset>0x310</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_DGST0">
          <name>CRYPTO_HMAC_DGST3</name>
          <displayName>CRYPTO_HMAC_DGST3</displayName>
          <description>SHA/HMAC Digest Message 3</description>
          <addressOffset>0x314</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_DGST0">
          <name>CRYPTO_HMAC_DGST4</name>
          <displayName>CRYPTO_HMAC_DGST4</displayName>
          <description>SHA/HMAC Digest Message 4</description>
          <addressOffset>0x318</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_DGST0">
          <name>CRYPTO_HMAC_DGST5</name>
          <displayName>CRYPTO_HMAC_DGST5</displayName>
          <description>SHA/HMAC Digest Message 5</description>
          <addressOffset>0x31C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_DGST0">
          <name>CRYPTO_HMAC_DGST6</name>
          <displayName>CRYPTO_HMAC_DGST6</displayName>
          <description>SHA/HMAC Digest Message 6</description>
          <addressOffset>0x320</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_DGST0">
          <name>CRYPTO_HMAC_DGST7</name>
          <displayName>CRYPTO_HMAC_DGST7</displayName>
          <description>SHA/HMAC Digest Message 7</description>
          <addressOffset>0x324</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_DGST0">
          <name>CRYPTO_HMAC_DGST8</name>
          <displayName>CRYPTO_HMAC_DGST8</displayName>
          <description>SHA/HMAC Digest Message 8</description>
          <addressOffset>0x328</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_DGST0">
          <name>CRYPTO_HMAC_DGST9</name>
          <displayName>CRYPTO_HMAC_DGST9</displayName>
          <description>SHA/HMAC Digest Message 9</description>
          <addressOffset>0x32C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_DGST0">
          <name>CRYPTO_HMAC_DGST10</name>
          <displayName>CRYPTO_HMAC_DGST10</displayName>
          <description>SHA/HMAC Digest Message 10</description>
          <addressOffset>0x330</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_DGST0">
          <name>CRYPTO_HMAC_DGST11</name>
          <displayName>CRYPTO_HMAC_DGST11</displayName>
          <description>SHA/HMAC Digest Message 11</description>
          <addressOffset>0x334</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_DGST0">
          <name>CRYPTO_HMAC_DGST12</name>
          <displayName>CRYPTO_HMAC_DGST12</displayName>
          <description>SHA/HMAC Digest Message 12</description>
          <addressOffset>0x338</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_DGST0">
          <name>CRYPTO_HMAC_DGST13</name>
          <displayName>CRYPTO_HMAC_DGST13</displayName>
          <description>SHA/HMAC Digest Message 13</description>
          <addressOffset>0x33C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_DGST0">
          <name>CRYPTO_HMAC_DGST14</name>
          <displayName>CRYPTO_HMAC_DGST14</displayName>
          <description>SHA/HMAC Digest Message 14</description>
          <addressOffset>0x340</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_HMAC_DGST0">
          <name>CRYPTO_HMAC_DGST15</name>
          <displayName>CRYPTO_HMAC_DGST15</displayName>
          <description>SHA/HMAC Digest Message 15</description>
          <addressOffset>0x344</addressOffset>
       </register>
       <register>
          <name>CRYPTO_HMAC_KEYCNT</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_HMAC_KEYCNT</displayName>
          <description>SHA/HMAC Key Byte Count Register</description>
          <addressOffset>0x348</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>KEYCNT</name>
              <description>SHA/HMAC Key Byte Count\nThe CRYPTO_HMAC_KEYCNT keeps the byte count of key that SHA/HMAC engine operates. The register is 32-bit and the maximum byte count is 4G bytes. It can be read and written. \nWriting to the register CRYPTO_HMAC_KEYCNT as the SHA/HMAC accelerator operating doesn't affect the current SHA/HMAC operation. But the value of CRYPTO_SHA _KEYCNT will be updated later on. Consequently, software can prepare the key count for the next SHA/HMAC operation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_HMAC_SADDR</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_HMAC_SADDR</displayName>
          <description>SHA/HMAC DMA Source Address Register</description>
          <addressOffset>0x34C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SADDR</name>
              <description>SHA/HMAC DMA Source Address\nThe SHA/HMAC accelerator supports DMA function to transfer the plain text between SRAM memory space and embedded FIFO. The CRYPTO_HMAC_SADDR keeps the source address of the data buffer where the source text is stored. Based on the source address, the SHA/HMAC accelerator can read the plain text from SRAM memory space and do SHA/HMAC operation. The start of source address should be located at word boundary. In other words, bit 1 and 0 of CRYPTO_HMAC_SADDR are ignored.\nCRYPTO_HMAC_SADDR can be read and written. Writing to CRYPTO_HMAC_SADDR while the SHA/HMAC accelerator is operating doesn't affect the current SHA/HMAC operation. But the value of CRYPTO_HMAC_SADDR will be updated later on. Consequently, software can prepare the DMA source address for the next SHA/HMAC operation.\nIn DMA mode, software can update the next CRYPTO_HMAC_SADDR before triggering START.\nCRYPTO_HMAC_SADDR and CRYPTO_HMAC_DADDR can be the same in the value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_HMAC_DMACNT</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_HMAC_DMACNT</displayName>
          <description>SHA/HMAC Byte Count Register</description>
          <addressOffset>0x350</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMACNT</name>
              <description>SHA/HMAC Operation Byte Count\nThe CRYPTO_HMAC_DMACNT keeps the byte count of source text that is for the SHA/HMAC engine operating in DMA mode. The CRYPTO_HMAC_DMACNT is 32-bit and the maximum of byte count is 4G bytes.\nCRYPTO_HMAC_DMACNT can be read and written. Writing to CRYPTO_HMAC_DMACNT while the SHA/HMAC accelerator is operating doesn't affect the current SHA/HMAC operation. But the value of CRYPTO_HMAC_DMACNT will be updated later on. Consequently, software can prepare the byte count of data for the next SHA/HMAC operation.\nIn Non-DMA mode, CRYPTO_HMAC_DMACNT must be set as the byte count of the last block before feeding in the last block of data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>CRYPTO_HMAC_DATIN</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_HMAC_DATIN</displayName>
          <description>SHA/HMAC Engine Non-dMA Mode Data Input Port Register</description>
          <addressOffset>0x354</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATIN</name>
              <description>SHA/HMAC Engine Input Port\nCPU feeds data to SHA/HMAC engine through this port by checking CRYPTO_HMAC_STS. Feed data as DATINREQ is 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
