Aspiring-Freeman/ArmPromgramDownloadPyocd/Driver/pyOCD/pyocd/debug/svd/data/M480_v1.svd
       <register derivedFrom="CRYPTO_ECC_Y1_00">
          <name>CRYPTO_ECC_Y1_05</name>
          <displayName>CRYPTO_ECC_Y1_05</displayName>
          <description>ECC the Y-coordinate Word5 of the First Point</description>
          <addressOffset>0x864</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y1_00">
          <name>CRYPTO_ECC_Y1_06</name>
          <displayName>CRYPTO_ECC_Y1_06</displayName>
          <description>ECC the Y-coordinate Word6 of the First Point</description>
          <addressOffset>0x868</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y1_00">
          <name>CRYPTO_ECC_Y1_07</name>
          <displayName>CRYPTO_ECC_Y1_07</displayName>
          <description>ECC the Y-coordinate Word7 of the First Point</description>
          <addressOffset>0x86C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y1_00">
          <name>CRYPTO_ECC_Y1_08</name>
          <displayName>CRYPTO_ECC_Y1_08</displayName>
          <description>ECC the Y-coordinate Word8 of the First Point</description>
          <addressOffset>0x870</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y1_00">
          <name>CRYPTO_ECC_Y1_09</name>
          <displayName>CRYPTO_ECC_Y1_09</displayName>
          <description>ECC the Y-coordinate Word9 of the First Point</description>
          <addressOffset>0x874</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y1_00">
          <name>CRYPTO_ECC_Y1_10</name>
          <displayName>CRYPTO_ECC_Y1_10</displayName>
          <description>ECC the Y-coordinate Word10 of the First Point</description>
          <addressOffset>0x878</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y1_00">
          <name>CRYPTO_ECC_Y1_11</name>
          <displayName>CRYPTO_ECC_Y1_11</displayName>
          <description>ECC the Y-coordinate Word11 of the First Point</description>
          <addressOffset>0x87C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y1_00">
          <name>CRYPTO_ECC_Y1_12</name>
          <displayName>CRYPTO_ECC_Y1_12</displayName>
          <description>ECC the Y-coordinate Word12 of the First Point</description>
          <addressOffset>0x880</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y1_00">
          <name>CRYPTO_ECC_Y1_13</name>
          <displayName>CRYPTO_ECC_Y1_13</displayName>
          <description>ECC the Y-coordinate Word13 of the First Point</description>
          <addressOffset>0x884</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y1_00">
          <name>CRYPTO_ECC_Y1_14</name>
          <displayName>CRYPTO_ECC_Y1_14</displayName>
          <description>ECC the Y-coordinate Word14 of the First Point</description>
          <addressOffset>0x888</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y1_00">
          <name>CRYPTO_ECC_Y1_15</name>
          <displayName>CRYPTO_ECC_Y1_15</displayName>
          <description>ECC the Y-coordinate Word15 of the First Point</description>
          <addressOffset>0x88C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y1_00">
          <name>CRYPTO_ECC_Y1_16</name>
          <displayName>CRYPTO_ECC_Y1_16</displayName>
          <description>ECC the Y-coordinate Word16 of the First Point</description>
          <addressOffset>0x890</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y1_00">
          <name>CRYPTO_ECC_Y1_17</name>
          <displayName>CRYPTO_ECC_Y1_17</displayName>
          <description>ECC the Y-coordinate Word17 of the First Point</description>
          <addressOffset>0x894</addressOffset>
       </register>
       <register>
          <name>CRYPTO_ECC_X2_00</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_ECC_X2_00</displayName>
          <description>ECC the X-coordinate Word0 of the Second Point</description>
          <addressOffset>0x898</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>POINTX2</name>
              <description>ECC the x-coordinate Value of the Second Point (POINTX2)\nFor B-163 or K-163, POINTX2 is stored in CRYPTO_ECC_X2_00~CRYPTO_ECC_X2_05\nFor B-233 or K-233, POINTX2 is stored in CRYPTO_ECC_X2_00~CRYPTO_ECC_X2_07\nFor B-283 or K-283, POINTX2 is stored in CRYPTO_ECC_X2_00~CRYPTO_ECC_X2_08\nFor B-409 or K-409, POINTX2 is stored in CRYPTO_ECC_X2_00~CRYPTO_ECC_X2_12\nFor B-571 or K-571, POINTX2 is stored in CRYPTO_ECC_X2_00~CRYPTO_ECC_X2_17\nFor P-192, POINTX2 is stored in CRYPTO_ECC_X2_00~CRYPTO_ECC_X2_05\nFor P-224, POINTX2 is stored in CRYPTO_ECC_X2_00~CRYPTO_ECC_X2_06\nFor P-256, POINTX2 is stored in CRYPTO_ECC_X2_00~CRYPTO_ECC_X2_07\nFor P-384, POINTX2 is stored in CRYPTO_ECC_X2_00~CRYPTO_ECC_X2_11\nFor P-521, POINTX2 is stored in CRYPTO_ECC_X2_00~CRYPTO_ECC_X2_16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="CRYPTO_ECC_X2_00">
          <name>CRYPTO_ECC_X2_01</name>
          <displayName>CRYPTO_ECC_X2_01</displayName>
          <description>ECC the X-coordinate Word1 of the Second Point</description>
          <addressOffset>0x89C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X2_00">
          <name>CRYPTO_ECC_X2_02</name>
          <displayName>CRYPTO_ECC_X2_02</displayName>
          <description>ECC the X-coordinate Word2 of the Second Point</description>
          <addressOffset>0x8A0</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X2_00">
          <name>CRYPTO_ECC_X2_03</name>
          <displayName>CRYPTO_ECC_X2_03</displayName>
          <description>ECC the X-coordinate Word3 of the Second Point</description>
          <addressOffset>0x8A4</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X2_00">
          <name>CRYPTO_ECC_X2_04</name>
          <displayName>CRYPTO_ECC_X2_04</displayName>
          <description>ECC the X-coordinate Word4 of the Second Point</description>
          <addressOffset>0x8A8</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X2_00">
          <name>CRYPTO_ECC_X2_05</name>
          <displayName>CRYPTO_ECC_X2_05</displayName>
          <description>ECC the X-coordinate Word5 of the Second Point</description>
          <addressOffset>0x8AC</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X2_00">
          <name>CRYPTO_ECC_X2_06</name>
          <displayName>CRYPTO_ECC_X2_06</displayName>
          <description>ECC the X-coordinate Word6 of the Second Point</description>
          <addressOffset>0x8B0</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X2_00">
          <name>CRYPTO_ECC_X2_07</name>
          <displayName>CRYPTO_ECC_X2_07</displayName>
          <description>ECC the X-coordinate Word7 of the Second Point</description>
          <addressOffset>0x8B4</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X2_00">
          <name>CRYPTO_ECC_X2_08</name>
          <displayName>CRYPTO_ECC_X2_08</displayName>
          <description>ECC the X-coordinate Word8 of the Second Point</description>
          <addressOffset>0x8B8</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X2_00">
          <name>CRYPTO_ECC_X2_09</name>
          <displayName>CRYPTO_ECC_X2_09</displayName>
          <description>ECC the X-coordinate Word9 of the Second Point</description>
          <addressOffset>0x8BC</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X2_00">
          <name>CRYPTO_ECC_X2_10</name>
          <displayName>CRYPTO_ECC_X2_10</displayName>
          <description>ECC the X-coordinate Word10 of the Second Point</description>
          <addressOffset>0x8C0</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X2_00">
          <name>CRYPTO_ECC_X2_11</name>
          <displayName>CRYPTO_ECC_X2_11</displayName>
          <description>ECC the X-coordinate Word11 of the Second Point</description>
          <addressOffset>0x8C4</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X2_00">
          <name>CRYPTO_ECC_X2_12</name>
          <displayName>CRYPTO_ECC_X2_12</displayName>
          <description>ECC the X-coordinate Word12 of the Second Point</description>
          <addressOffset>0x8C8</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X2_00">
          <name>CRYPTO_ECC_X2_13</name>
          <displayName>CRYPTO_ECC_X2_13</displayName>
          <description>ECC the X-coordinate Word13 of the Second Point</description>
          <addressOffset>0x8CC</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X2_00">
          <name>CRYPTO_ECC_X2_14</name>
          <displayName>CRYPTO_ECC_X2_14</displayName>
          <description>ECC the X-coordinate Word14 of the Second Point</description>
          <addressOffset>0x8D0</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X2_00">
          <name>CRYPTO_ECC_X2_15</name>
          <displayName>CRYPTO_ECC_X2_15</displayName>
          <description>ECC the X-coordinate Word15 of the Second Point</description>
          <addressOffset>0x8D4</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X2_00">
          <name>CRYPTO_ECC_X2_16</name>
          <displayName>CRYPTO_ECC_X2_16</displayName>
          <description>ECC the X-coordinate Word16 of the Second Point</description>
          <addressOffset>0x8D8</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_X2_00">
          <name>CRYPTO_ECC_X2_17</name>
          <displayName>CRYPTO_ECC_X2_17</displayName>
          <description>ECC the X-coordinate Word17 of the Second Point</description>
          <addressOffset>0x8DC</addressOffset>
       </register>
       <register>
          <name>CRYPTO_ECC_Y2_00</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_ECC_Y2_00</displayName>
          <description>ECC the Y-coordinate Word0 of the Second Point</description>
          <addressOffset>0x8E0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>POINTY2</name>
              <description>ECC the Y-coordinate Value of the Second Point (POINTY2)\nFor B-163 or K-163, POINTY2 is stored in CRYPTO_ECC_Y2_00~CRYPTO_ECC_Y2_05\nFor B-233 or K-233, POINTY2 is stored in CRYPTO_ECC_Y2_00~CRYPTO_ECC_Y2_07\nFor B-283 or K-283, POINTY2 is stored in CRYPTO_ECC_Y2_00~CRYPTO_ECC_Y2_08\nFor B-409 or K-409, POINTY2 is stored in CRYPTO_ECC_Y2_00~CRYPTO_ECC_Y2_12\nFor B-571 or K-571, POINTY2 is stored in CRYPTO_ECC_Y2_00~CRYPTO_ECC_Y2_17\nFor P-192, POINTY2 is stored in CRYPTO_ECC_Y2_00~CRYPTO_ECC_Y2_05\nFor P-224, POINTY2 is stored in CRYPTO_ECC_Y2_00~CRYPTO_ECC_Y2_06\nFor P-256, POINTY2 is stored in CRYPTO_ECC_Y2_00~CRYPTO_ECC_Y2_07\nFor P-384, POINTY2 is stored in CRYPTO_ECC_Y2_00~CRYPTO_ECC_Y2_11\nFor P-521, POINTY2 is stored in CRYPTO_ECC_Y2_00~CRYPTO_ECC_Y2_16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y2_00">
          <name>CRYPTO_ECC_Y2_01</name>
          <displayName>CRYPTO_ECC_Y2_01</displayName>
          <description>ECC the Y-coordinate Word1 of the Second Point</description>
          <addressOffset>0x8E4</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y2_00">
          <name>CRYPTO_ECC_Y2_02</name>
          <displayName>CRYPTO_ECC_Y2_02</displayName>
          <description>ECC the Y-coordinate Word2 of the Second Point</description>
          <addressOffset>0x8E8</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y2_00">
          <name>CRYPTO_ECC_Y2_03</name>
          <displayName>CRYPTO_ECC_Y2_03</displayName>
          <description>ECC the Y-coordinate Word3 of the Second Point</description>
          <addressOffset>0x8EC</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y2_00">
          <name>CRYPTO_ECC_Y2_04</name>
          <displayName>CRYPTO_ECC_Y2_04</displayName>
          <description>ECC the Y-coordinate Word4 of the Second Point</description>
          <addressOffset>0x8F0</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y2_00">
          <name>CRYPTO_ECC_Y2_05</name>
          <displayName>CRYPTO_ECC_Y2_05</displayName>
          <description>ECC the Y-coordinate Word5 of the Second Point</description>
          <addressOffset>0x8F4</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y2_00">
          <name>CRYPTO_ECC_Y2_06</name>
          <displayName>CRYPTO_ECC_Y2_06</displayName>
          <description>ECC the Y-coordinate Word6 of the Second Point</description>
          <addressOffset>0x8F8</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y2_00">
          <name>CRYPTO_ECC_Y2_07</name>
          <displayName>CRYPTO_ECC_Y2_07</displayName>
          <description>ECC the Y-coordinate Word7 of the Second Point</description>
          <addressOffset>0x8FC</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y2_00">
          <name>CRYPTO_ECC_Y2_08</name>
          <displayName>CRYPTO_ECC_Y2_08</displayName>
          <description>ECC the Y-coordinate Word8 of the Second Point</description>
          <addressOffset>0x900</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y2_00">
          <name>CRYPTO_ECC_Y2_09</name>
          <displayName>CRYPTO_ECC_Y2_09</displayName>
          <description>ECC the Y-coordinate Word9 of the Second Point</description>
          <addressOffset>0x904</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y2_00">
          <name>CRYPTO_ECC_Y2_10</name>
          <displayName>CRYPTO_ECC_Y2_10</displayName>
          <description>ECC the Y-coordinate Word10 of the Second Point</description>
          <addressOffset>0x908</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y2_00">
          <name>CRYPTO_ECC_Y2_11</name>
          <displayName>CRYPTO_ECC_Y2_11</displayName>
          <description>ECC the Y-coordinate Word11 of the Second Point</description>
          <addressOffset>0x90C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y2_00">
          <name>CRYPTO_ECC_Y2_12</name>
          <displayName>CRYPTO_ECC_Y2_12</displayName>
          <description>ECC the Y-coordinate Word12 of the Second Point</description>
          <addressOffset>0x910</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y2_00">
          <name>CRYPTO_ECC_Y2_13</name>
          <displayName>CRYPTO_ECC_Y2_13</displayName>
          <description>ECC the Y-coordinate Word13 of the Second Point</description>
          <addressOffset>0x914</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y2_00">
          <name>CRYPTO_ECC_Y2_14</name>
          <displayName>CRYPTO_ECC_Y2_14</displayName>
          <description>ECC the Y-coordinate Word14 of the Second Point</description>
          <addressOffset>0x918</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y2_00">
          <name>CRYPTO_ECC_Y2_15</name>
          <displayName>CRYPTO_ECC_Y2_15</displayName>
          <description>ECC the Y-coordinate Word15 of the Second Point</description>
          <addressOffset>0x91C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y2_00">
          <name>CRYPTO_ECC_Y2_16</name>
          <displayName>CRYPTO_ECC_Y2_16</displayName>
          <description>ECC the Y-coordinate Word16 of the Second Point</description>
          <addressOffset>0x920</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_Y2_00">
          <name>CRYPTO_ECC_Y2_17</name>
          <displayName>CRYPTO_ECC_Y2_17</displayName>
          <description>ECC the Y-coordinate Word17 of the Second Point</description>
          <addressOffset>0x924</addressOffset>
       </register>
       <register>
          <name>CRYPTO_ECC_A_00</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>CRYPTO_ECC_A_00</displayName>
          <description>ECC the Parameter CURVEA Word0 of Elliptic Curve</description>
          <addressOffset>0x928</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CURVEA</name>
              <description>ECC the Parameter CURVEA Value of Elliptic Curve (CURVEA)\nFor B-163 or K-163, CURVEA is stored in CRYPTO_ECC_A_00~CRYPTO_ECC_A_05\nFor B-233 or K-233, CURVEA is stored in CRYPTO_ECC_A_00~CRYPTO_ECC_A_07\nFor B-283 or K-283, CURVEA is stored in CRYPTO_ECC_A_00~CRYPTO_ECC_A_08\nFor B-409 or K-409, CURVEA is stored in CRYPTO_ECC_A_00~CRYPTO_ECC_A_12\nFor B-571 or K-571, CURVEA is stored in CRYPTO_ECC_A_00~CRYPTO_ECC_A_17\nFor P-192, CURVEA is stored in CRYPTO_ECC_A_00~CRYPTO_ECC_A_05\nFor P-224, CURVEA is stored in CRYPTO_ECC_A_00~CRYPTO_ECC_A_06\nFor P-256, CURVEA is stored in CRYPTO_ECC_A_00~CRYPTO_ECC_A_07\nFor P-384, CURVEA is stored in CRYPTO_ECC_A_00~CRYPTO_ECC_A_11\nFor P-521, CURVEA is stored in CRYPTO_ECC_A_00~CRYPTO_ECC_A_16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_01</name>
          <displayName>CRYPTO_ECC_A_01</displayName>
          <description>ECC the Parameter CURVEA Word1 of Elliptic Curve</description>
          <addressOffset>0x92C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_02</name>
          <displayName>CRYPTO_ECC_A_02</displayName>
          <description>ECC the Parameter CURVEA Word2 of Elliptic Curve</description>
          <addressOffset>0x930</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_03</name>
          <displayName>CRYPTO_ECC_A_03</displayName>
          <description>ECC the Parameter CURVEA Word3 of Elliptic Curve</description>
          <addressOffset>0x934</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_04</name>
          <displayName>CRYPTO_ECC_A_04</displayName>
          <description>ECC the Parameter CURVEA Word4 of Elliptic Curve</description>
          <addressOffset>0x938</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_05</name>
          <displayName>CRYPTO_ECC_A_05</displayName>
          <description>ECC the Parameter CURVEA Word5 of Elliptic Curve</description>
          <addressOffset>0x93C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_06</name>
          <displayName>CRYPTO_ECC_A_06</displayName>
          <description>ECC the Parameter CURVEA Word6 of Elliptic Curve</description>
          <addressOffset>0x940</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_07</name>
          <displayName>CRYPTO_ECC_A_07</displayName>
          <description>ECC the Parameter CURVEA Word7 of Elliptic Curve</description>
          <addressOffset>0x944</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_08</name>
          <displayName>CRYPTO_ECC_A_08</displayName>
          <description>ECC the Parameter CURVEA Word8 of Elliptic Curve</description>
          <addressOffset>0x948</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_09</name>
          <displayName>CRYPTO_ECC_A_09</displayName>
          <description>ECC the Parameter CURVEA Word9 of Elliptic Curve</description>
          <addressOffset>0x94C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_10</name>
          <displayName>CRYPTO_ECC_A_10</displayName>
          <description>ECC the Parameter CURVEA Word10 of Elliptic Curve</description>
          <addressOffset>0x950</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_11</name>
          <displayName>CRYPTO_ECC_A_11</displayName>
          <description>ECC the Parameter CURVEA Word11 of Elliptic Curve</description>
          <addressOffset>0x954</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_12</name>
          <displayName>CRYPTO_ECC_A_12</displayName>
          <description>ECC the Parameter CURVEA Word12 of Elliptic Curve</description>
          <addressOffset>0x958</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_13</name>
          <displayName>CRYPTO_ECC_A_13</displayName>
          <description>ECC the Parameter CURVEA Word13 of Elliptic Curve</description>
          <addressOffset>0x95C</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_14</name>
          <displayName>CRYPTO_ECC_A_14</displayName>
          <description>ECC the Parameter CURVEA Word14 of Elliptic Curve</description>
          <addressOffset>0x960</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_15</name>
          <displayName>CRYPTO_ECC_A_15</displayName>
          <description>ECC the Parameter CURVEA Word15 of Elliptic Curve</description>
          <addressOffset>0x964</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_16</name>
          <displayName>CRYPTO_ECC_A_16</displayName>
          <description>ECC the Parameter CURVEA Word16 of Elliptic Curve</description>
          <addressOffset>0x968</addressOffset>
       </register>
       <register derivedFrom="CRYPTO_ECC_A_00">
          <name>CRYPTO_ECC_A_17</name>
          <displayName>CRYPTO_ECC_A_17</displayName>
          <description>ECC the Parameter CURVEA Word17 of Elliptic Curve</description>
          <addressOffset>0x96C</addressOffset>
       </register>
