Aspiring-Freeman/ArmPromgramDownloadPyocd/Driver/pyOCD/pyocd/debug/svd/data/M480_v1.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>EADC0</name>
      <description>EADC Register Map</description>
      <groupName>EADC</groupName>
      <baseAddress>0x40043000</baseAddress>
      <!-- the first addressBlock is occupied by registers. The second block is reserved -> no access permission -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x60</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x80</offset>
        <size>0x4C</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xD0</offset>
        <size>0x4C</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x130</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
       <register>
          <name>EADCx_DAT0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EADCx_DAT0</displayName>
          <description>EADC Data Register 0 for Sample Module 0</description>
          <addressOffset>0x0</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RESULT</name>
              <description>EADC Conversion Result\nThis field contains 12 bits conversion result.\nWhen DMOF (EADC_CTL[9]) is set to 0, 12-bit EADC conversion result with unsigned format will be filled in RESULT[11:0] and zero will be filled in RESULT[15:12].\nWhen DMOF (EADC_CTL[9]) set to 1, 12-bit EADC conversion result with 2'complement format will be filled in RESULT[11:0] and signed bits to will be filled in RESULT[15:12].</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OV</name>
              <description>Overrun Flag\nIf converted data in RESULT[11:0] has not been read before new conversion result is loaded to this register, OV is set to 1.\nNote: It is cleared by hardware after EADC_DAT register is read.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Data in RESULT[11:0] is recent conversion result</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Data in RESULT[11:0] is overwrite</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>VALID</name>
              <description>Valid Flag\nThis bit is set to 1 when corresponding sample module channel analog input conversion is completed and cleared by hardware after EADC_DAT register is read.\n</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Data in RESULT[11:0] bits is not valid</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Data in RESULT[11:0] bits is valid</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="EADCx_DAT0">
          <name>EADCx_DAT1</name>
          <displayName>EADCx_DAT1</displayName>
          <description>EADC Data Register 1 for Sample Module 1</description>
          <addressOffset>0x4</addressOffset>
       </register>
       <register derivedFrom="EADCx_DAT0">
          <name>EADCx_DAT2</name>
          <displayName>EADCx_DAT2</displayName>
          <description>EADC Data Register 2 for Sample Module 2</description>
          <addressOffset>0x8</addressOffset>
       </register>
       <register derivedFrom="EADCx_DAT0">
          <name>EADCx_DAT3</name>
          <displayName>EADCx_DAT3</displayName>
          <description>EADC Data Register 3 for Sample Module 3</description>
          <addressOffset>0xC</addressOffset>
       </register>
       <register derivedFrom="EADCx_DAT0">
          <name>EADCx_DAT4</name>
          <displayName>EADCx_DAT4</displayName>
          <description>EADC Data Register 4 for Sample Module 4</description>
          <addressOffset>0x10</addressOffset>
       </register>
       <register derivedFrom="EADCx_DAT0">
          <name>EADCx_DAT5</name>
          <displayName>EADCx_DAT5</displayName>
          <description>EADC Data Register 5 for Sample Module 5</description>
          <addressOffset>0x14</addressOffset>
       </register>
       <register derivedFrom="EADCx_DAT0">
          <name>EADCx_DAT6</name>
          <displayName>EADCx_DAT6</displayName>
          <description>EADC Data Register 6 for Sample Module 6</description>
          <addressOffset>0x18</addressOffset>
       </register>
       <register derivedFrom="EADCx_DAT0">
          <name>EADCx_DAT7</name>
          <displayName>EADCx_DAT7</displayName>
          <description>EADC Data Register 7 for Sample Module 7</description>
          <addressOffset>0x1C</addressOffset>
       </register>
       <register derivedFrom="EADCx_DAT0">
          <name>EADCx_DAT8</name>
          <displayName>EADCx_DAT8</displayName>
          <description>EADC Data Register 8 for Sample Module 8</description>
          <addressOffset>0x20</addressOffset>
       </register>
       <register derivedFrom="EADCx_DAT0">
          <name>EADCx_DAT9</name>
          <displayName>EADCx_DAT9</displayName>
          <description>EADC Data Register 9 for Sample Module 9</description>
          <addressOffset>0x24</addressOffset>
       </register>
       <register derivedFrom="EADCx_DAT0">
          <name>EADCx_DAT10</name>
          <displayName>EADCx_DAT10</displayName>
          <description>EADC Data Register 10 for Sample Module 10</description>
          <addressOffset>0x28</addressOffset>
       </register>
       <register derivedFrom="EADCx_DAT0">
          <name>EADCx_DAT11</name>
          <displayName>EADCx_DAT11</displayName>
          <description>EADC Data Register 11 for Sample Module 11</description>
          <addressOffset>0x2C</addressOffset>
       </register>
       <register derivedFrom="EADCx_DAT0">
          <name>EADCx_DAT12</name>
          <displayName>EADCx_DAT12</displayName>
          <description>EADC Data Register 12 for Sample Module 12</description>
          <addressOffset>0x30</addressOffset>
       </register>
       <register derivedFrom="EADCx_DAT0">
          <name>EADCx_DAT13</name>
          <displayName>EADCx_DAT13</displayName>
          <description>EADC Data Register 13 for Sample Module 13</description>
          <addressOffset>0x34</addressOffset>
       </register>
       <register derivedFrom="EADCx_DAT0">
          <name>EADCx_DAT14</name>
          <displayName>EADCx_DAT14</displayName>
          <description>EADC Data Register 14 for Sample Module 14</description>
          <addressOffset>0x38</addressOffset>
       </register>
       <register derivedFrom="EADCx_DAT0">
          <name>EADCx_DAT15</name>
          <displayName>EADCx_DAT15</displayName>
          <description>EADC Data Register 15 for Sample Module 15</description>
          <addressOffset>0x3C</addressOffset>
       </register>
       <register derivedFrom="EADCx_DAT0">
          <name>EADCx_DAT16</name>
          <displayName>EADCx_DAT16</displayName>
          <description>EADC Data Register 16 for Sample Module 16</description>
          <addressOffset>0x40</addressOffset>
       </register>
       <register derivedFrom="EADCx_DAT0">
          <name>EADCx_DAT17</name>
          <displayName>EADCx_DAT17</displayName>
          <description>EADC Data Register 17 for Sample Module 17</description>
          <addressOffset>0x44</addressOffset>
       </register>
       <register derivedFrom="EADCx_DAT0">
          <name>EADCx_DAT18</name>
          <displayName>EADCx_DAT18</displayName>
          <description>EADC Data Register 18 for Sample Module 18</description>
          <addressOffset>0x48</addressOffset>
       </register>
       <register>
          <name>EADCx_CURDAT</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EADCx_CURDAT</displayName>
          <description>EADC PDMA Current Transfer Data Register</description>
          <addressOffset>0x4C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CURDAT</name>
              <description>EADC PDMA Current Transfer Data (Read Only)\n</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>EADCx_CTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EADCx_CTL</displayName>
          <description>EADC Control Register</description>
          <addressOffset>0x50</addressOffset>
          <access>read-write</access>
          <resetValue>0x000000C0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADCEN</name>
              <description>EADC Converter Enable Bit\nNote: Before starting EADC conversion function, this bit should be set to 1. Clear it to 0 to disable EADC converter analog circuit power consumption.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Disabled EADC</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Enabled EADC</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCRST</name>
              <description>EADC Converter Control Circuits Reset\nNote: EADCRST bit remains 1 during EADC reset, when EADC reset end, the EADCRST bit is automatically cleared to 0.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No effect</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Cause EADC control circuits reset to initial state, but not change the EADC registers value</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCIEN0</name>
              <description>Specific Sample Module EADC ADINT0 Interrupt Enable Bit\nThe EADC converter generates a conversion end ADIF0 (EADC_STATUS2[0]) upon the end of specific sample module EADC conversion. If EADCIEN0 bit is set then conversion end interrupt request ADINT0 is generated.\n</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Specific sample module EADC ADINT0 interrupt function Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Specific sample module EADC ADINT0 interrupt function Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCIEN1</name>
              <description>Specific Sample Module EADC ADINT1 Interrupt Enable Bit\nThe EADC converter generates a conversion end ADIF1 (EADC_STATUS2[1]) upon the end of specific sample module EADC conversion. If EADCIEN1 bit is set then conversion end interrupt request ADINT1 is generated.\n</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Specific sample module EADC ADINT1 interrupt function Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Specific sample module EADC ADINT1 interrupt function Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCIEN2</name>
              <description>Specific Sample Module EADC ADINT2 Interrupt Enable Bit\nThe EADC converter generates a conversion end ADIF2 (EADC_STATUS2[2]) upon the end of specific sample module EADC conversion. If EADCIEN2 bit is set then conversion end interrupt request ADINT2 is generated.\n</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Specific sample module EADC ADINT2 interrupt function Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Specific sample module EADC ADINT2 interrupt function Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCIEN3</name>
              <description>Specific Sample Module EADC ADINT3 Interrupt Enable Bit\nThe EADC converter generates a conversion end ADIF3 (EADC_STATUS2[3]) upon the end of specific sample module EADC conversion. If EADCIEN3 bit is set then conversion end interrupt request ADINT3 is generated.\n</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Specific sample module EADC ADINT3 interrupt function Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Specific sample module EADC ADINT3 interrupt function Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>RESSEL</name>
              <description>Resolution Selection\n</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>6-bit EADC result will be put at RESULT (EADC_DATn[5:0])</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>8-bit EADC result will be put at RESULT (EADC_DATn[7:0])</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>10-bit EADC result will be put at RESULT (EADC_DATn[9:0])</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>12-bit EADC result will be put at RESULT (EADC_DATn[11:0])</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DIFFEN</name>
              <description>Differential Analog Input Mode Enable Bit\n</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Single-end analog input mode</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Differential analog input mode</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DMOF</name>
              <description>EADC Differential Input Mode Output Format\n</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>EADC conversion result will be filled in RESULT (EADC_DATn[15:0], where n= 0 ~18) with unsigned format</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>EADC conversion result will be filled in RESULT (EADC_DATn[15:0], where n= 0 ~18) with 2'complement format</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>EADCx_SWTRG</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EADCx_SWTRG</displayName>
          <description>EADC Sample Module Software Start Register</description>
          <addressOffset>0x54</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWTRG</name>
              <description>EADC Sample Module 0~18 Software Force to Start EADC Conversion\nNote: After writing this register to start EADC conversion, the EADC_PENDSTS register will show which sample module will conversion. If user want to disable the conversion of the sample module, user can write EADC_PENDSTS register to clear it.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>19</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No effect</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Cause an EADC conversion when the priority is given to sample module</description>
                    <value>1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>write-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>EADCx_PENDSTS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EADCx_PENDSTS</displayName>
          <description>EADC Start of Conversion Pending Flag Register</description>
          <addressOffset>0x58</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STPF</name>
              <description>EADC Sample Module 0~18 Start of Conversion Pending Flag\nRead Operation:\n</description>
              <bitOffset>0</bitOffset>
              <bitWidth>19</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>There is no pending conversion for sample module</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Sample module EADC start of conversion is pending.\nCear pending flag &amp; cancel the conversion for sample module</description>
                    <value>1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>EADCx_OVSTS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EADCx_OVSTS</displayName>
          <description>EADC Sample Module Start of Conversion Overrun Flag Register</description>
          <addressOffset>0x5C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SPOVF</name>
              <description>EADC SAMPLE0~18 Overrun Flag\nNote: This bit is cleared by writing 1 to it.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>19</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No sample module event overrun</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Indicates a new sample module event is generated while an old one event is pending</description>
                    <value>1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
