Aspiring-Freeman/ArmPromgramDownloadPyocd/Driver/pyOCD/pyocd/debug/svd/data/M480_v1.svd
       <register derivedFrom="EADCx_SCTL4">
          <name>EADCx_SCTL5</name>
          <displayName>EADCx_SCTL5</displayName>
          <description>EADC Sample Module 5 Control Register</description>
          <addressOffset>0x94</addressOffset>
       </register>
       <register derivedFrom="EADCx_SCTL4">
          <name>EADCx_SCTL6</name>
          <displayName>EADCx_SCTL6</displayName>
          <description>EADC Sample Module 6 Control Register</description>
          <addressOffset>0x98</addressOffset>
       </register>
       <register derivedFrom="EADCx_SCTL4">
          <name>EADCx_SCTL7</name>
          <displayName>EADCx_SCTL7</displayName>
          <description>EADC Sample Module 7 Control Register</description>
          <addressOffset>0x9C</addressOffset>
       </register>
       <register derivedFrom="EADCx_SCTL4">
          <name>EADCx_SCTL8</name>
          <displayName>EADCx_SCTL8</displayName>
          <description>EADC Sample Module 8 Control Register</description>
          <addressOffset>0xA0</addressOffset>
       </register>
       <register derivedFrom="EADCx_SCTL4">
          <name>EADCx_SCTL9</name>
          <displayName>EADCx_SCTL9</displayName>
          <description>EADC Sample Module 9 Control Register</description>
          <addressOffset>0xA4</addressOffset>
       </register>
       <register derivedFrom="EADCx_SCTL4">
          <name>EADCx_SCTL10</name>
          <displayName>EADCx_SCTL10</displayName>
          <description>EADC Sample Module 10 Control Register</description>
          <addressOffset>0xA8</addressOffset>
       </register>
       <register derivedFrom="EADCx_SCTL4">
          <name>EADCx_SCTL11</name>
          <displayName>EADCx_SCTL11</displayName>
          <description>EADC Sample Module 11 Control Register</description>
          <addressOffset>0xAC</addressOffset>
       </register>
       <register derivedFrom="EADCx_SCTL4">
          <name>EADCx_SCTL12</name>
          <displayName>EADCx_SCTL12</displayName>
          <description>EADC Sample Module 12 Control Register</description>
          <addressOffset>0xB0</addressOffset>
       </register>
       <register derivedFrom="EADCx_SCTL4">
          <name>EADCx_SCTL13</name>
          <displayName>EADCx_SCTL13</displayName>
          <description>EADC Sample Module 13 Control Register</description>
          <addressOffset>0xB4</addressOffset>
       </register>
       <register derivedFrom="EADCx_SCTL4">
          <name>EADCx_SCTL14</name>
          <displayName>EADCx_SCTL14</displayName>
          <description>EADC Sample Module 14 Control Register</description>
          <addressOffset>0xB8</addressOffset>
       </register>
       <register derivedFrom="EADCx_SCTL4">
          <name>EADCx_SCTL15</name>
          <displayName>EADCx_SCTL15</displayName>
          <description>EADC Sample Module 15 Control Register</description>
          <addressOffset>0xBC</addressOffset>
       </register>
       <register>
          <name>EADCx_SCTL16</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EADCx_SCTL16</displayName>
          <description>EADC Sample Module 16 Control Register</description>
          <addressOffset>0xC0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EXTSMPT</name>
              <description>EADC Sampling Time Extend\nWhen EADC converting at high conversion rate, the sampling time of analog input voltage may not enough if input channel loading is heavy, SW can extend EADC sampling time after trigger source is coming to get enough sampling time.\nThe range of start delay time is from 0~255 EADC clock.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="EADCx_SCTL16">
          <name>EADCx_SCTL17</name>
          <displayName>EADCx_SCTL17</displayName>
          <description>EADC Sample Module 17 Control Register</description>
          <addressOffset>0xC4</addressOffset>
       </register>
       <register derivedFrom="EADCx_SCTL16">
          <name>EADCx_SCTL18</name>
          <displayName>EADCx_SCTL18</displayName>
          <description>EADC Sample Module 18 Control Register</description>
          <addressOffset>0xC8</addressOffset>
       </register>
       <register>
          <name>EADCx_INTSRC0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EADCx_INTSRC0</displayName>
          <description>EADC Interrupt 0 Source Enable Control Register.</description>
          <addressOffset>0xD0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SPLIE0</name>
              <description>Sample Module 0 Interrupt Enable Bit\n</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Sample Module 0 interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Sample Module 0 interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SPLIE1</name>
              <description>Sample Module 1 Interrupt Enable Bit\n</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Sample Module 1 interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Sample Module 1 interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SPLIE2</name>
              <description>Sample Module 2 Interrupt Enable Bit\n</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Sample Module 2 interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Sample Module 2 interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SPLIE3</name>
              <description>Sample Module 3 Interrupt Enable Bit\n</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Sample Module 3 interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Sample Module 3 interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SPLIE4</name>
              <description>Sample Module 4 Interrupt Enable Bit\n</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Sample Module 4 interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Sample Module 4 interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SPLIE5</name>
              <description>Sample Module 5 Interrupt Enable Bit\n</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Sample Module 5 interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Sample Module 5 interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SPLIE6</name>
              <description>Sample Module 6 Interrupt Enable Bit\n</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Sample Module 6 interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Sample Module 6 interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SPLIE7</name>
              <description>Sample Module 7 Interrupt Enable Bit\n</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Sample Module 7 interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Sample Module 7 interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SPLIE8</name>
              <description>Sample Module 8 Interrupt Enable Bit\n</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Sample Module 8 interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Sample Module 8 interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SPLIE9</name>
              <description>Sample Module 9 Interrupt Enable Bit\n</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Sample Module 9 interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Sample Module 9 interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SPLIE10</name>
              <description>Sample Module 10 Interrupt Enable Bit\n</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Sample Module 10 interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Sample Module 10 interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SPLIE11</name>
              <description>Sample Module 11 Interrupt Enable Bit\n</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Sample Module 11 interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Sample Module 11 interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SPLIE12</name>
              <description>Sample Module 12 Interrupt Enable Bit\n</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Sample Module 12 interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Sample Module 12 interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SPLIE13</name>
              <description>Sample Module 13 Interrupt Enable Bit\n</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Sample Module 13 interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Sample Module 13 interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SPLIE14</name>
              <description>Sample Module 14 Interrupt Enable Bit\n</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Sample Module 14 interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Sample Module 14 interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SPLIE15</name>
              <description>Sample Module 15 Interrupt Enable Bit\n</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Sample Module 15 interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Sample Module 15 interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SPLIE16</name>
              <description>Sample Module 16 Interrupt Enable Bit\n</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Sample Module 16 interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Sample Module 16 interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SPLIE17</name>
              <description>Sample Module 17 Interrupt Enable Bit\n</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Sample Module 17 interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Sample Module 17 interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SPLIE18</name>
              <description>Sample Module 18 Interrupt Enable Bit\n</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Sample Module 18 interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Sample Module 18 interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="EADCx_INTSRC0">
          <name>EADCx_INTSRC1</name>
          <displayName>EADCx_INTSRC1</displayName>
          <description>EADC Interrupt 1 Source Enable Control Register.</description>
          <addressOffset>0xD4</addressOffset>
       </register>
       <register derivedFrom="EADCx_INTSRC0">
          <name>EADCx_INTSRC2</name>
          <displayName>EADCx_INTSRC2</displayName>
          <description>EADC Interrupt 2 Source Enable Control Register.</description>
          <addressOffset>0xD8</addressOffset>
       </register>
       <register derivedFrom="EADCx_INTSRC0">
          <name>EADCx_INTSRC3</name>
          <displayName>EADCx_INTSRC3</displayName>
          <description>EADC Interrupt 3 Source Enable Control Register.</description>
          <addressOffset>0xDC</addressOffset>
       </register>
