Aspiring-Freeman/ArmPromgramDownloadPyocd/Driver/pyOCD/pyocd/debug/svd/data/M480_v1.svd
       <register>
          <name>EADCx_STATUS3</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EADCx_STATUS3</displayName>
          <description>EADC Status Register 3</description>
          <addressOffset>0xFC</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000001F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CURSPL</name>
              <description>EADC Current Sample Module (Read Only)\nThis register shows the current EADC is controlled by which sample module control logic modules.\nIf the EADC is Idle, the bit filed will set to 0x1F.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>EADCx_DDAT0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EADCx_DDAT0</displayName>
          <description>EADC Double Data Register 0 for Sample Module 0</description>
          <addressOffset>0x100</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RESULT</name>
              <description>EADC Conversion Results\nThis field contains 12 bits conversion results.\nWhen the DMOF (EADC_CTL[9]) is set to 0, 12-bit EADC conversion result with unsigned format will be filled in RESULT [11:0] and zero will be filled in RESULT [15:12].\nWhen DMOF (EADC_CTL[9]) is set to 1, 12-bit EADC conversion result with 2'complement format will be filled in RESULT [11:0] and signed bits to will be filled in RESULT [15:12].</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OV</name>
              <description>Overrun Flag\nIf converted data in RESULT[15:0] has not been read before new conversion result is loaded to this register, OV is set to 1. It is cleared by hardware after EADC_DDAT register is read.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Data in RESULT (EADC_DATn[15:0], n=0~3) is recent conversion result</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Data in RESULT (EADC_DATn[15:0], n=0~3) is overwrite</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>VALID</name>
              <description>Valid Flag\n</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Double data in RESULT (EADC_DDATn[15:0]) is not valid</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Double data in RESULT (EADC_DDATn[15:0]) is valid</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="EADCx_DDAT0">
          <name>EADCx_DDAT1</name>
          <displayName>EADCx_DDAT1</displayName>
          <description>EADC Double Data Register 1 for Sample Module 1</description>
          <addressOffset>0x104</addressOffset>
       </register>
       <register derivedFrom="EADCx_DDAT0">
          <name>EADCx_DDAT2</name>
          <displayName>EADCx_DDAT2</displayName>
          <description>EADC Double Data Register 2 for Sample Module 2</description>
          <addressOffset>0x108</addressOffset>
       </register>
       <register derivedFrom="EADCx_DDAT0">
          <name>EADCx_DDAT3</name>
          <displayName>EADCx_DDAT3</displayName>
          <description>EADC Double Data Register 3 for Sample Module 3</description>
          <addressOffset>0x10C</addressOffset>
       </register>
       <register>
          <name>EADCx_PWRM</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EADCx_PWRM</displayName>
          <description>EADC Power Management Register</description>
          <addressOffset>0x110</addressOffset>
          <access>read-write</access>
          <resetValue>0x0006E012</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PWUPRDY</name>
              <description>EADC Power-up Sequence Completed and Ready for Conversion (Read Only)\n</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>EADC is not ready for conversion may be in power down state or in the progress of start up</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>EADC is ready for conversion</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>PWUCALEN</name>
              <description>Power Up Calibration Function Enable Bit\nNote: This bit work together with CALSEL (EADC_CALCTL [3]), see the following\n{PWUCALEN, CALSEL } Description:\nPWUCALEN is 0 and CALSEL is 0: No need to calibrate. \nPWUCALEN is 0 and CALSEL is 1: No need to calibrate.\nPWUCALEN is 1 and CALSEL is 0: Load calibration word when power up.\nPWUCALEN is 1 and CALSEL is 1: Calibrate when power up.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Calibration function Disabled at power up</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Calibration function Enabled at power up</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>PWDMOD</name>
              <description>EADC Power-down Mode\nSet this bit field to select EADC Power-down mode when system power-down.\nNote: Different PWDMOD has different power down/up sequence, in order to avoid EADC powering up with wrong sequence; user must keep PWDMOD consistent each time in power down and start up.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>EADC Deep Power-down mode</description>
                    <value>#00</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>EADC Power down</description>
                    <value>#01</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>2</name>
                    <description>EADC Standby mode</description>
                    <value>#10</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>3</name>
                    <description>EADC Deep Power-down mode</description>
                    <value>#11</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>LDOSUT</name>
              <description>EADC Internal LDO Start-up Time\n</description>
              <bitOffset>8</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>EADCx_CALCTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EADCx_CALCTL</displayName>
          <description>EADC Calibration Control Register</description>
          <addressOffset>0x114</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000008</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CALSTART</name>
              <description>Calibration Functional Block Start\nNote 1: This bit is set by SW and clear by HW after re-calibration finish.\nNote 2: Before set CALSTART (EADC_CALCTL[1]) as 1 to start calibration again, EADCDIV (CKL_CLKDIV0[23:16]) must be 0.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Stop calibration functional block</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Start calibration functional block</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>CALDONE</name>
              <description>Calibration Functional Block Complete (Read Only)\n</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>During a calibration</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Calibration is completed</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>CALSEL</name>
              <description>Select Calibration Functional Block\n</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Load calibration word when calibration functional block is active</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Execute calibration when calibration functional block is active</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>EADCx_CALDWRD</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EADCx_CALDWRD</displayName>
          <description>EADC Calibration Load Word Register</description>
          <addressOffset>0x118</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFF00</resetMask>
          <fields>
            <field>
              <name>CALWORD</name>
              <description>Calibration Word Bits\nWrite to this register with the previous calibration word before load calibration action.\nRead this register after calibration done.\nNote: The calibration block contains two parts "CALIBRATION" and "LOAD CALIBRATION"; if the calibration block configure as "CALIBRATION"; then this register represent the result of calibration when calibration is completed; if configure as "LOAD CALIBRATION" ; configure this register before loading calibration action, after loading calibration complete, the laoded calibration word will apply to the EADC; while in loading calibration function the loaded value will not be equal to the original CALWORD until calibration is done.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>EADCx_PDMACTL</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EADCx_PDMACTL</displayName>
          <description>EADC PDMA Control Register</description>
          <addressOffset>0x130</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PDMATEN</name>
              <description>PDMA Transfer Enable Bit\nWhen EADC conversion is completed, the converted data is loaded into EADC_DATn (n: 0 ~ 18) register, user can enable this bit to generate a PDMA data transfer request.\n</description>
              <bitOffset>0</bitOffset>
              <bitWidth>19</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>PDMA data transfer Disabled</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>PDMA data transfer Enabled</description>
                    <value>1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
